{"id":13023,"date":"2023-12-19T23:50:42","date_gmt":"2023-12-19T22:50:42","guid":{"rendered":"https:\/\/securenest.org\/?p=13023"},"modified":"2024-01-24T20:14:58","modified_gmt":"2024-01-24T19:14:58","slug":"cardano-consensus-mechanism","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/cardano-consensus-mechanism","title":{"rendered":"Consensus Mechanism of Cardano (ADA): A Deep Dive Into Ouroboros"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2024\/01\/cardano-consensus-mechanism.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"An image of a network of connected dots representing the Ouroboros algorithm used in Cardano.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2024\/01\/cardano-consensus-mechanism.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2024\/01\/cardano-consensus-mechanism-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2024\/01\/cardano-consensus-mechanism-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2024\/01\/cardano-consensus-mechanism-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p>The consensus mechanism of Cardano (ADA) is a critical component of its blockchain protocol, ensuring the security and reliability of the network.<\/p>\n\n\n\n<p>In this deep dive into Ouroboros, the consensus algorithm behind Cardano, we will explore its intricacies and technical aspects to provide a comprehensive understanding of how it operates.<\/p>\n\n\n\n<p>This authoritative exploration aims to shed light on the essentials of the Cardano consensus mechanism, including the participatory role of staking in the consensus process.<\/p>\n\n\n\n<p>Additionally, we will delve into the evolution of Ouroboros iterations and compare them to gain insights into the continuous improvement of the protocol.<\/p>\n\n\n\n<p>By delving into the depths of Ouroboros, we seek to equip our audience with the knowledge needed to grasp the inner workings of Cardano&#8217;s consensus mechanism.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Key Takeaways<\/h2>\n\n\n\n<ul>\n<li>Ouroboros is the proof-of-stake (PoS) consensus mechanism behind Cardano, providing a secure and decentralized infrastructure for the blockchain.<\/li>\n\n\n\n<li>It eliminates the need for energy-intensive mining and reduces the risk of centralization, allowing users to participate based on the number of coins they hold.<\/li>\n\n\n\n<li>Ouroboros ensures the integrity of transactions, prevents double-spending, and undergoes rigorous peer review and testing to ensure network security.<\/li>\n\n\n\n<li>Delegation and participation in staking pools are crucial aspects of Cardano&#8217;s consensus mechanism, allowing users to earn rewards and participate without technical expertise or constant online presence.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Unveiling the Cardano Consensus Mechanism: An Insider&#8217;s Perspective<\/h2>\n\n\n\n<p>From an insider&#8217;s perspective, this article unveils the Cardano consensus mechanism, shedding light on its intricate workings and underlying principles.<\/p>\n\n\n\n<p>Cardano utilizes a unique consensus mechanism known as Ouroboros, which is a proof-of-stake (PoS) protocol. Unlike traditional proof-of-work (PoW) systems that consume vast amounts of energy, Ouroboros ensures the security and integrity of the <a href=\"https:\/\/securenest.org\/learn\/cardano-blockchain-technology\">Cardano blockchain<\/a> through a more energy-efficient approach.<\/p>\n\n\n\n<p>Ouroboros divides time into epochs and slots, with each slot representing a fixed duration. The protocol selects a leader for each slot through a randomized process, ensuring fairness and preventing centralization. This leader then creates a new block and propagates it to the network.<\/p>\n\n\n\n<p>Through this process, Cardano achieves consensus and maintains the integrity of its blockchain. The Ouroboros protocol has been rigorously tested and verified, making Cardano a reliable and secure blockchain platform.<\/p>\n\n\n\n<p>To expand your knowledge on ADA Blockchain, delve into further details with <a href=\"https:\/\/securenest.org\/learn\/cardano-blockchain-interoperability\">Cardano Blockchain Interoperability<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Essentials of the Cardano Consensus Mechanism<\/h2>\n\n\n\n<p>The Cardano consensus mechanism, powered by Ouroboros, plays a crucial role in the infrastructure of the platform. It ensures decentralization and security by relying on a proof-of-stake algorithm.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of Ouroboros in Cardano&#8217;s Infrastructure<\/h3>\n\n\n\n<p>Ouroboros plays a crucial role in the infrastructure of Cardano by providing a secure and decentralized consensus mechanism. <\/p>\n\n\n\n<p>As a cryptocurrency built on the blockchain technology, Cardano relies on consensus to ensure the validity and immutability of transactions. Ouroboros achieves this through a proof-of-stake (PoS) protocol, which allows participants to validate transactions and create new blocks based on the amount of ADA they hold. <\/p>\n\n\n\n<p>This consensus mechanism is designed to be energy-efficient and scalable, making Cardano a sustainable and reliable platform for decentralized applications. To better understand the role of Ouroboros in Cardano&#8217;s infrastructure, let&#8217;s take a look at the following table:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><thead><tr><th>Consensus Mechanism<\/th><th>Features<\/th><th>Benefits<\/th><\/tr><\/thead><tbody><tr><td>Ouroboros<\/td><td>Secure and decentralized<\/td><td>Ensures the integrity of transactions and prevents double-spending<\/td><\/tr><tr><td>&nbsp;<\/td><td>Energy-efficient<\/td><td>Reduces the environmental impact compared to proof-of-work systems<\/td><\/tr><tr><td>&nbsp;<\/td><td>Scalable<\/td><td>Accommodates a growing number of transactions and users<\/td><\/tr><tr><td>&nbsp;<\/td><td>Reliable<\/td><td>Provides a robust and resilient infrastructure for decentralized applications<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\">How Cardano Achieves Decentralization and Security<\/h3>\n\n\n\n<p>Cardano achieves decentralization and security through its innovative consensus mechanism. It employs a proof-of-stake protocol that ensures the integrity of transactions while reducing environmental impact and accommodating a growing number of users and transactions.<\/p>\n\n\n\n<p>Unlike traditional proof-of-work systems, Cardano&#8217;s proof-of-stake approach allows users to participate in the validation process based on the number of coins they hold, rather than computational power. This eliminates the need for energy-intensive mining and reduces the risk of centralization by limiting control to a few powerful entities.<\/p>\n\n\n\n<p>Moreover, Cardano&#8217;s consensus mechanism ensures network security through regular updates and improvements. The blockchain technology undergoes rigorous peer review and rigorous testing before implementation, making it highly resistant to attacks.<\/p>\n\n\n\n<p>Through a combination of proof-of-stake, decentralization, and continuous security enhancements, Cardano offers a robust and sustainable platform for secure transactions and data storage.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Technical Aspects of Ouroboros Protocol<\/h2>\n\n\n\n<p>The technical aspects of the Ouroboros protocol in Cardano are critical to understanding its consensus mechanism. These aspects include the concept of epochs and slots, which form the fundamental cycles of the protocol.<\/p>\n\n\n\n<p>Additionally, the selection of slot leaders and their responsibilities play a significant role in maintaining the network&#8217;s integrity.<\/p>\n\n\n\n<p>Finally, the cryptographic underpinnings of Ouroboros ensure the security and immutability of the Cardano blockchain.<\/p>\n\n\n\n<p>Understanding these technical aspects is essential for grasping the inner workings of the Ouroboros protocol.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Epochs and Slots &#8211; The Fundamentals of Ouroboros Cycle<\/h3>\n\n\n\n<p>Epochs and slots are fundamental components of the Ouroboros cycle, playing a crucial role in the technical aspects of the protocol.<\/p>\n\n\n\n<p>In the Cardano blockchain architecture, the Ouroboros protocol is a proof-of-stake consensus mechanism that ensures the security and efficiency of the network.<\/p>\n\n\n\n<p>An epoch is a specific period of time during which the protocol operates, typically lasting five days. Each epoch is divided into fixed-length slots, which represent discrete moments within the epoch.<\/p>\n\n\n\n<p>These slots are used to schedule block production and enable the verification of transactions. The Ouroboros cycle consists of epochs and slots, with each epoch containing a fixed number of slots.<\/p>\n\n\n\n<p>The use of epochs and slots in the Ouroboros protocol helps to maintain the integrity and speed of Cardano&#8217;s transaction processing, making it a robust and scalable blockchain solution.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Selection of Slot Leaders and Their Responsibilities<\/h3>\n\n\n\n<p>During each epoch in the Ouroboros protocol, a selection process is employed to determine the slot leaders responsible for block production and transaction verification. This process ensures a fair and secure operation of the Cardano blockchain.<\/p>\n\n\n\n<p>The selection of slot leaders is based on a cryptographic lottery system, where the likelihood of being chosen as a slot leader is proportional to the amount of stake held by a participant. This mechanism incentivizes stakeholders to hold and delegate their ADA tokens to trustworthy parties, as it increases their chances of being selected as slot leaders.<\/p>\n\n\n\n<p>Once selected, slot leaders have the responsibility of creating new blocks, verifying transactions, and propagating them throughout the network. By distributing these responsibilities, the Ouroboros consensus mechanism ensures that the blockchain remains decentralized and resistant to attacks.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The Cryptographic Underpinnings Ensuring Network Integrity<\/h3>\n\n\n\n<p>The cryptographic underpinnings of the Ouroboros protocol play a crucial role in ensuring the network integrity of the Cardano blockchain.<\/p>\n\n\n\n<p>Ouroboros, the consensus mechanism of Cardano, utilizes various cryptographic techniques to secure the network and maintain the integrity of transactions.<\/p>\n\n\n\n<p>One of the key aspects is the use of a secure random number generator (RNG) to select slot leaders who are responsible for creating blocks. This RNG is based on verifiable random functions (VRFs), which provide a way to generate unpredictable and unbiased random numbers.<\/p>\n\n\n\n<p>Additionally, Ouroboros employs cryptographic primitives such as digital signatures and hash functions to ensure the authenticity and immutability of data.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Staking in Cardano: Participatory Role in Consensus<\/h2>\n\n\n\n<p>Staking plays a crucial role in the consensus mechanism of Cardano. It allows participants to actively engage in the network&#8217;s decision-making process and contribute to its security and decentralization.<\/p>\n\n\n\n<p>Understanding concepts such as delegation and staking pools is essential. These concepts enable stakeholders to delegate their ADA tokens to a trusted entity that will represent their interests in the consensus protocol.<\/p>\n\n\n\n<p>Furthermore, the incentive structures and stakeholder rewards system incentivize active participation and discourage centralization of staking power. This ensures a fair and inclusive ecosystem for all participants.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Understanding Delegation and Staking Pools<\/h3>\n\n\n\n<p>Delegation and participation in staking pools play a vital role in the consensus mechanism of Cardano (Ada), allowing users to regularly contribute to the network&#8217;s decision-making process. In the Cardano ecosystem, staking pools are groups of stakeholders who combine their resources to increase their chances of being selected as slot leaders and earning rewards.<\/p>\n\n\n\n<p>By delegating their stake to a staking pool, users can participate in the consensus protocol without the need for technical expertise or constant online presence. This delegation process involves choosing a trusted pool operator and assigning them the responsibility of representing the user&#8217;s stake in the network.<\/p>\n\n\n\n<p>Staking pools enhance the decentralization of the Cardano network and enable a broader participation in the consensus mechanism, ensuring the security and stability of the Ouroboros protocol.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Incentive Structures and Stakeholder Rewards<\/h3>\n\n\n\n<p>In Cardano&#8217;s consensus mechanism, the participatory role in consensus and stakeholder rewards is determined by the incentive structures. These structures are designed to encourage active participation and ensure the security and stability of the Cardano blockchain.<\/p>\n\n\n\n<p>Here are some key aspects of the incentive structures and stakeholder rewards in Cardano:<\/p>\n\n\n\n<ul>\n<li><strong>Proof of Stake (PoS) Algorithm<\/strong>: Cardano utilizes the Ouroboros PoS algorithm, which allows stakeholders to participate in the consensus process by staking their ADA tokens.<\/li>\n\n\n\n<li><strong>Staking Rewards<\/strong>: Stakeholders who actively participate in the consensus process by staking their ADA tokens have the opportunity to earn staking rewards. These rewards are distributed based on the stakeholder&#8217;s proportion of the total ADA staked.<\/li>\n\n\n\n<li><strong>Decentralization Incentives<\/strong>: Cardano&#8217;s incentive structures are designed to promote decentralization by rewarding stakeholders who delegate their stake to smaller stake pools. This encourages a more diverse and distributed network.<\/li>\n\n\n\n<li><strong>Long-Term Sustainability<\/strong>: The incentive structures also aim to ensure the long-term sustainability of the Cardano blockchain by providing rewards for stakeholders who hold and stake their ADA tokens over an extended period.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Measures Against Centralization of Staking Power<\/h3>\n\n\n\n<p>To mitigate the concentration of staking power, Cardano implements measures that ensure a more decentralized and participatory role in the consensus process.<\/p>\n\n\n\n<p>One of these measures is the use of a proof-of-stake consensus mechanism called Ouroboros. Ouroboros allows stakeholders to participate in the selection of the next block to be added to the blockchain based on the amount of ADA they hold and are willing to stake.<\/p>\n\n\n\n<p>However, to prevent centralization, Cardano introduces the concept of stake pools. Stake pools are groups of stakeholders who pool their resources together to increase their chances of being selected as slot leaders. This encourages a more even distribution of staking power and prevents a single entity from gaining too much control over the consensus process.<\/p>\n\n\n\n<p>Additionally, Cardano implements a protocol parameter called the saturation point, which limits the amount of stake that a single pool can have, further promoting decentralization.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Comparison and Evolution of Ouroboros Iterations<\/h2>\n\n\n\n<p>The evolution of the Ouroboros consensus mechanism in Cardano has led to the development of several iterations, each with its own unique features and improvements.<\/p>\n\n\n\n<p>Ouroboros Classic, the original version, paved the way for Ouroboros Praos, which introduced a more efficient and secure protocol.<\/p>\n\n\n\n<p>The introduction of Ouroboros Genesis brought significant performance enhancements, while Ouroboros Hydra added interoperability features, making Cardano more scalable and adaptable to future needs.<\/p>\n\n\n\n<p>These iterations represent the continuous effort to enhance the Cardano network&#8217;s consensus mechanism, ensuring its robustness and effectiveness in achieving decentralized consensus.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Ouroboros Classic vs. Ouroboros Praos<\/h3>\n\n\n\n<p>A comprehensive analysis of the consensus mechanism of Cardano (Ada) reveals the contrasting features and evolutionary advancements between Ouroboros Classic and Ouroboros Praos.<\/p>\n\n\n\n<p><strong>Ouroboros Classic:<\/strong><\/p>\n\n\n\n<ul>\n<li>Based on a proof-of-stake (PoS) model, where participants take turns to be the leader and create blocks.<\/li>\n\n\n\n<li>Requires a synchronized network, making it vulnerable to certain attacks.<\/li>\n\n\n\n<li>Adopts a &#8216;follow the Satoshi&#8217; principle, where the longest chain is considered the valid one.<\/li>\n\n\n\n<li>Provides security guarantees through the use of cryptographic protocols.<\/li>\n<\/ul>\n\n\n\n<p><strong>Ouroboros Praos:<\/strong><\/p>\n\n\n\n<ul>\n<li>Overcomes the synchronization requirement by introducing a decentralized random beacon.<\/li>\n\n\n\n<li>Enables continuous block creation and reduces the time between blocks, improving efficiency.<\/li>\n\n\n\n<li>Introduces a new security model called &#8216;adaptive security,&#8217; which ensures the system remains secure even if a large portion of participants are malicious.<\/li>\n\n\n\n<li>Enhances the resilience and robustness of the consensus mechanism.<\/li>\n<\/ul>\n\n\n\n<p>The evolution from Ouroboros Classic to Ouroboros Praos brings significant improvements to the Cardano ecosystem, enhancing security, efficiency, and scalability.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Performance Enhancements with Ouroboros Genesis<\/h3>\n\n\n\n<p>With the introduction of Ouroboros Genesis, the performance of Cardano&#8217;s consensus mechanism has been significantly enhanced through the evolution and comparison of various iterations of Ouroboros.<\/p>\n\n\n\n<p>Ouroboros Genesis is the latest version of the Ouroboros protocol, which underpins the Cardano blockchain. It is designed to improve scalability and address the limitations of previous iterations.<\/p>\n\n\n\n<p>One of the key performance enhancements of Ouroboros Genesis is the introduction of delegation, allowing users to delegate their stake to a trusted party to participate in the consensus process. This delegation mechanism increases the overall participation in the network, making it more secure and decentralized.<\/p>\n\n\n\n<p>Additionally, Ouroboros Genesis incorporates improvements in network connectivity, block size, and transaction throughput, resulting in faster and more efficient processing of transactions.<\/p>\n\n\n\n<p>These performance enhancements make Cardano&#8217;s consensus mechanism more robust and scalable, ensuring the platform&#8217;s ability to handle increased usage and demand.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Interoperability Features with Ouroboros Hydra<\/h3>\n\n\n\n<p>Interoperability features are a key focus in the evolution and comparison of Ouroboros iterations, specifically with Ouroboros Hydra. The Cardano blockchain has made significant advancements in providing interoperability between different systems and networks. Here are four important aspects of its interoperability features:<\/p>\n\n\n\n<ul>\n<li><strong>Multi-chain architecture:<\/strong> Ouroboros Hydra allows the creation of multiple chains that can run in parallel, enabling greater scalability and interoperability.<\/li>\n\n\n\n<li><strong>Cross-chain communication:<\/strong> With Ouroboros Hydra, different chains can communicate and exchange information seamlessly, facilitating interoperability between different blockchain networks.<\/li>\n\n\n\n<li><strong>Smart contract compatibility:<\/strong> Ouroboros Hydra is designed to support smart contracts, allowing developers to build decentralized applications that can interact with multiple chains.<\/li>\n\n\n\n<li><strong>Interoperability with legacy systems:<\/strong> Cardano recognizes the importance of interoperability with traditional systems and is exploring ways to connect blockchain technology with existing infrastructure.<\/li>\n<\/ul>\n\n\n\n<p>The incorporation of these interoperability features into the Ouroboros Hydra consensus mechanism demonstrates Cardano&#8217;s commitment to creating a robust and interconnected blockchain ecosystem.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Frequently Asked Questions<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">What Is the Historical Background and Development Timeline of the Ouroboros Protocol?<\/h3>\n\n\n\n<p>The historical background and development timeline of the Ouroboros protocol is a crucial aspect to understanding Cardano&#8217;s consensus mechanism. It provides insight into the origins, evolution, and key milestones that have shaped this innovative and secure approach to achieving consensus in a decentralized network.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How Does the Ouroboros Protocol Ensure Security Against Various Attack Vectors?<\/h3>\n\n\n\n<p>The Ouroboros protocol ensures security against various attack vectors by utilizing a decentralized network of nodes that participate in a verifiable random function, ensuring fairness and preventing malicious actors from gaining control of the network.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What Are the Requirements for Staking in Cardano and How Does It Contribute to the Consensus Mechanism?<\/h3>\n\n\n\n<p>Staking in Cardano is a requirement for participating in the consensus mechanism. It involves holding and delegating ADA tokens to a stake pool, which contributes to the security and decentralization of the network.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Can the Ouroboros Protocol Be Integrated With Other Blockchain Platforms or Is It Exclusively Designed for Cardano?<\/h3>\n\n\n\n<p>The Ouroboros protocol, which is the consensus mechanism of Cardano, can be integrated with other blockchain platforms. Its design and theoretical foundations make it adaptable and applicable to various blockchain networks, not exclusively limited to Cardano.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What Are the Potential Limitations or Challenges That May Arise With the Implementation of the Ouroboros Protocol in Real-World Scenarios?<\/h3>\n\n\n\n<p>The potential limitations or challenges that may arise with the implementation of the Ouroboros protocol in real-world scenarios include scalability issues, security vulnerabilities, and the need for continuous updates to address emerging threats and technological advancements.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion<\/h2>\n\n\n\n<p>Cardano&#8217;s consensus mechanism, Ouroboros, is a carefully designed protocol that ensures the security and decentralization of the network.<\/p>\n\n\n\n<p>With its focus on stakeholder participation and the use of cryptographic techniques, Ouroboros provides a robust and efficient solution for achieving consensus in a decentralized manner.<\/p>\n\n\n\n<p>The evolution of Ouroboros iterations showcases the commitment of the Cardano project to continuously improve and adapt its consensus mechanism to meet the needs of its growing ecosystem.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gain an in-depth understanding of Cardano&#8217;s Ouroboros consensus mechanism and its significance in blockchain security.<\/p>\n","protected":false},"author":4,"featured_media":13926,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[193],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/13023"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=13023"}],"version-history":[{"count":10,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/13023\/revisions"}],"predecessor-version":[{"id":13957,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/13023\/revisions\/13957"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/13926"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=13023"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=13023"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=13023"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}