{"id":235,"date":"2022-11-06T22:51:13","date_gmt":"2022-11-06T21:51:13","guid":{"rendered":"https:\/\/securenest.org\/?p=235"},"modified":"2024-01-24T23:35:11","modified_gmt":"2024-01-24T22:35:11","slug":"are-bitcoins-divisible","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/are-bitcoins-divisible","title":{"rendered":"Are Bitcoins Divisible? Bitcoin Divisibility Explained!"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/are-bitcoins-divisible.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"A stack of divisible bitcoin coins on a red background.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/are-bitcoins-divisible.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/are-bitcoins-divisible-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/are-bitcoins-divisible-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/are-bitcoins-divisible-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>Bitcoin has a greater divisibility than traditional currency<\/li>\n\n\n\n<li>One bitcoin is divisible up to a 100 million times to its smallest unit called Satoshi<\/li>\n\n\n\n<li>Bitcoin&#8217;s high divisibility ensures distinct advantages over traditional currencies<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Are Bitcoins Divisible?<\/h2>\n\n\n\n<p>Bitcoin can be divided in the same way as our known traditional currencies.&nbsp;<\/p>\n\n\n\n<p>It is <a href=\"https:\/\/securenest.org\/learn\/bitcoin-advantages-disadvantages\" data-type=\"post\" data-id=\"3705\" target=\"_blank\" rel=\"noopener\">one of Bitcoins features<\/a> that makes it unique compared to other currencies. <\/p>\n\n\n\n<p>A hundred units is the divisibility for the dollar or euro.This is, in fact, one crucial factor. This crypto has the potential to be adopted by society if everyone can use it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Divide Bitcoin?<\/strong><\/h2>\n\n\n\n<p>We can divide a single <a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">bitcoin<\/a> up to hundred million units. <\/p>\n\n\n\n<p>This gives Bitcoin an enormous advantage over traditional currencies.&nbsp;<\/p>\n\n\n\n<p>Divisibility is one of the key aspects of money. A currency should be divisible, durable, transportable and non tamper-proof. This high divisibility ensures distinct advantages over traditional currencies.&nbsp;<\/p>\n\n\n\n<p>You will learn some of the main key factors showing the potential this cryptocurrency can bring to this area in the following article.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Can I Buy Less Than a Bitcoin?<\/strong><\/h2>\n\n\n\n<p>Yes, you can buy less than a bitcoin.&nbsp;<\/p>\n\n\n\n<p>People often think they can just buy one whole bitcoin.&nbsp;<\/p>\n\n\n\n<p>This would be impossible for most people. If you could just buy a whole bitcoin, there would be a problem with adoption. Because of its high divisibility, people can buy the smallest fractions of it, making it possible for everyone to buy Bitcoin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why is Bitcoin Divisible?<\/strong><\/h2>\n\n\n\n<p>Every currency needs divisibility to be practical for an economy.&nbsp;<\/p>\n\n\n\n<p>We should use <a href=\"https:\/\/crsreports.congress.gov\/product\/pdf\/R\/R45427\" target=\"_blank\" rel=\"noreferrer noopener\">money for all goods<\/a> with different values.<\/p>\n\n\n\n<p>People should be able to buy everything from bubble gum to real estate with currency.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Divisibility for Everyday Use<\/strong><\/h3>\n\n\n\n<p>Divisibility is the reason <a href=\"http:\/\/www.amosweb.com\/cgi-bin\/awb_nav.pl?s=wpd&amp;c=dsp&amp;k=money+characteristics\" target=\"_blank\" rel=\"noreferrer noopener\">people used metals like gold and silver<\/a> over several thousand years as a medium of exchange.&nbsp;<\/p>\n\n\n\n<p>Humanity developed then from these kinds of metals to currencies in paper form.&nbsp;<\/p>\n\n\n\n<p>Paper didn’t have any value, so gold backed it. Governments separated gold from the dollar in World War I to print more of it.<\/p>\n\n\n\n<p>If you would buy something cheap, a currency should give you the possibility to do it. The smaller you can divide a currency, the more flexible it becomes.<\/p>\n\n\n\n<p>This is the reason traditional currencies have smaller units as cents. It makes them usable for the smallest transactions. This was one of the key aspects of giving them value.&nbsp;<\/p>\n\n\n\n<p>Cryptocurrencies can use this aspect to make them more usable than other types of currency.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Divisibility Because of Scarcity<\/strong><\/h3>\n\n\n\n<p>Another reason for the Bitcoin divisibility lies in its scarcity.&nbsp;<\/p>\n\n\n\n<p>Bitcoin is limited to 21 million units.&nbsp;<\/p>\n\n\n\n<p>This isn&#8217;t a problem today, but in the future, it will be a problem. If prices would reach a million dollars per bitcoin, with two decimal points, the smallest possible purchase would be $10,000. Bitcoin’s scarcity could lead to such high prices one day.&nbsp;<\/p>\n\n\n\n<p>This potential scenario forces Bitcoin to ensure a higher divisibility. The supply of Bitcoin is considerably smaller than fiat currencies. The dollar has a current supply of about 21.5 trillion and the euro with 15.4 trillion.&nbsp;<\/p>\n\n\n\n<p>Bitcoin has to be much more divisible to compete with fiat currencies. With a million dollar per bitcoin and its divisibility, the smallest Bitcoin purchase possible still would only cost a cent.&nbsp;<\/p>\n\n\n\n<p>Imagine we would now have all the 21 million bitcoins mined. We currently have <a href=\"https:\/\/www.un.org\/development\/desa\/pd\/sites\/www.un.org.development.desa.pd\/files\/wpp2022_summary_of_results.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">about 8 billion people<\/a> on earth. So how could everyone get Bitcoin? Because of the scarcity, it wouldn’t be possible.&nbsp;<\/p>\n\n\n\n<p>Even with two decimal places, we would have only 2.1 billion units. It is possible to have over two quadrillion units with the current divisibility.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Divisibility for Transaction Fees<\/strong><\/h3>\n\n\n\n<p>Transaction fees are an important part of the Bitcoin network.&nbsp;<\/p>\n\n\n\n<p>The participants would have fewer incentives to run the system without them and spam transactions could slow down the Blockchain.<\/p>\n\n\n\n<p>There was a minimum transaction fee in the first days of Bitcon of 0.01 BTC. Bitcoin has increased in value and amount of transactions, so the Bitcoin protocol removed this limitation.&nbsp;<\/p>\n\n\n\n<p>A high divisibility is a prerequisite to make transactions cheap. Miners get paid with these fees to incentivize them apart from the block reward they get.<\/p>\n\n\n\n<p>Assuming a Bitcoin price of $10,000 and only two decimal points available, every transaction would cost $100. Bitcoin&#8217;s purpose is to improve our current monetary system. With this goal in mind, it offers more flexibility than we currently have.<\/p>\n\n\n\n<p>That means transaction fees should be lower than alternative payment methods. This would make users more likely to use Bitcoin instead of fiat, which is known for high transaction fees. One prominent example is transactions between countries.<\/p>\n\n\n\n<p>With traditional banks, the fees can get extremely high for a regular wire transfer. With low fees, people can transfer value all over the world.<\/p>\n\n\n\n<p>There are some prominent examples of Bitcoin transactions with high volumes and low fees. One transaction was in 2018, where a user transferred nearly 30k bitcoins worth at about $194 million with a fee of&nbsp; $0.10.<\/p>\n\n\n\n<p>Wise, known as one of the cheapest banks, would charge a minimum fee of $4,100 for a regular bank transaction of only $1 million. This shows one of the extreme differences this digital currency can bring to us.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Divisibility of Bitcoin Ensures a Wider Range of Payments<\/strong><\/h3>\n\n\n\n<p>One advantage Bitcoin has over fiat currencies because of its divisibility is for micro-payments.&nbsp;<\/p>\n\n\n\n<p>With its small increments, Bitcoin could work for payments not possible today.&nbsp;<\/p>\n\n\n\n<p>Micro-payments are typically payments under a few dollars. A common scenario is to buy something in a store for a dollar. You could buy it with a credit card. But transaction fees often have a specific base fee.<\/p>\n\n\n\n<p>Therefore, many shop owners allow credit card payments from something like $5 upwards. So the transaction won’t execute. Now imagine this happens 30 times a day.&nbsp;<\/p>\n\n\n\n<p>Within a month, this would be an enormous loss in potential profit for the shop owner. Micro-payments could solve that and open new markets for other applications.<\/p>\n\n\n\n<p>The problem with fiat currencies is the minimum units available. With a cent, you could buy nearly everything. It could be too much money for specific use cases. With micro-payments, offerings can become much more flexible.<\/p>\n\n\n\n<p>An example would be a content creator who charges a fee for every second of a video watched instead of a monthly subscription fee.&nbsp;<\/p>\n\n\n\n<p>Many users won’t pay high fees but would more likely pay with micro-payments for one time usage. Musicians could directly charge for every song stream instead of subscriptions or buying the whole album.<\/p>\n\n\n\n<p>Often people want to use something just one time but are forced to buy subscriptions or bigger packages they do not need.<\/p>\n\n\n\n<p>There are further scenarios possible and overall Bitcoin could enable micro-payments because of its divisibility, which is not really practical with the payment solutions we have today.<\/p>\n\n\n\n<p>More use cases will evolve, creating a whole new market helping with the adoption of Bitcoin. The small units of Bitcoin also have a term.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a Satoshi?<\/strong><\/h2>\n\n\n\n<p>A Satoshi is the smallest unit of a Bitcoin.&nbsp;<\/p>\n\n\n\n<p>1 BTC comprises 100 million Satoshis, or 0.00000001 BTC.&nbsp;<\/p>\n\n\n\n<p>They named this unit after the inventor Satoshi Nakamoto. The Blockchain calculates in Satoshi as a basis. Bitcoins are only a &#8216;bunch&#8217; of a hundred million of these.&nbsp;<\/p>\n\n\n\n<p>Bitcoin was not extremely valuable in terms of dollars up to now, so denoting everything in Bitcoin was practical. This is the reason people denote prices in Bitcoin instead of Satoshi.&nbsp;<\/p>\n\n\n\n<p>This, however, could change potentially in the future, as Bitcoin could become more valuable. If Bitcoin continues to increase in value, people would use one Satoshi instead as the everyday measurement unit.&nbsp;<\/p>\n\n\n\n<p>But between the two, there is a gap of a hundred million units. It would be more useful to have some designation describing different amounts of Bitcoins and Satoshis for everyday usage. There is no real standard for name designation.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Can Bitcoin Be Divided Infinitely?<\/strong><\/h2>\n\n\n\n<p>Bitcoin is divisible into 100 million Satoshi or <a href=\"https:\/\/diposit.ub.edu\/dspace\/bitstream\/2445\/126055\/1\/TFG-GEI-Abella-Claudia-Jun18.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">8 decimal places<\/a>.&nbsp;<\/p>\n\n\n\n<p>This is a lot, but it does not mean that Bitcoin is infinitely divisible. Currently, this is the maximum divisibility Bitcoin offers.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Much Can Bitcoin Be Divided?<\/strong><\/h2>\n\n\n\n<p>For now, we can divide Bitcoin into eight decimal places.&nbsp;<\/p>\n\n\n\n<p>But this might change.&nbsp;<\/p>\n\n\n\n<p>How divisible is Bitcoin potentially? Can Bitcoin be divided infinitely? We could change Bitcoin with a layer (implemented changes in the Bitcoin code for further functionalities).&nbsp;<\/p>\n\n\n\n<p>It then would be modified to handle even smaller units and theoretically be nearly infinitely divisible. Its open source code can change Bitcoin for such purposes. The future price of Bitcoin could be the reason this is realistic.&nbsp;<\/p>\n\n\n\n<p>We already had Bitcoin at prices about $60,000. Given that Bitcoin could achieve market prices of $100,000, people who would want to buy just one cent worth of Bitcoin would have to use already six of the eight decimal points available now.<\/p>\n\n\n\n<p>What would be in the future if Bitcoin becomes an even higher valued currency, that 1 Satoshi would equal a value of several hundred dollars? This would need a solution to make Bitcoin further divisible to be usable for small transactions.<\/p>\n\n\n\n<p>This doesn’t seem to make sense compared to traditional currencies. If we need more money, then we just multiply it. This is the common way we do it with fiat currencies. When we need more, we print more.<\/p>\n\n\n\n<p>This would be against one of the key aspects of Bitcoin, its scarcity. The limited <a href=\"https:\/\/crypto.stanford.edu\/~xb\/fc12\/bitcoin.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">supply of 21 million<\/a> ensures Bitcoin is scarce and cannot fall into the trap of inflation. So if the value continues to rise, the Bitcoin divisibility needs to be increased.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Difference Between Divisibility and Supply<\/strong><\/h3>\n\n\n\n<p>Some people think that a high divisibility might cause inflation.&nbsp;<\/p>\n\n\n\n<p>There is a similarity at the first moment.&nbsp;<\/p>\n\n\n\n<p>We multiply the amount of units similar to if we print more fiat money. Increasing divisibility differs from increasing the supply. Fiat currencies are always increasing in supply.&nbsp;<\/p>\n\n\n\n<p>That means that if a bank holds an amount of $100 million, they can print double the amount and then have $200 million. If they wanted to increase the divisibility, they would leave their $100 million and divide them further into smaller units.&nbsp;<\/p>\n\n\n\n<p>So instead of $0.01, they would divide it to $0.001. The divisibility would increase but not the supply. The supply wouldn’t change in this scenario. The $100 million would not get multiplied with the overall value staying the same, not causing inflation.&nbsp;<\/p>\n\n\n\n<p>Bitcoin uses this principle. There is no possibility of increasing it because of the limited number of 21 million bitcoins. If no one can print more bitcoins, the value can not depreciate, causing inflation. If one bitcoin gets divided, it still amounts to one bitcoin.<\/p>\n\n\n\n<p>So if we extend divisibility, there are more subunits, but the overall value of one bitcoin doesn’t change. The number of bitcoins will not get multiplied.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">FAQ<\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why Do Bitcoins Have Value?<\/strong><\/h2>\n\n\n\n<p>Bitcoins have value because they are scarce in supply, similar to gold or silver.&nbsp;<\/p>\n\n\n\n<p>This makes them an interesting investment opportunity, as their value is expected to increase over time because of the limited number of coins available.<\/p>\n\n\n\n<p>Bitcoin transactions are secure, anonymous, and fast. Bitcoins’ decentralized nature means that it is relatively immune from government interference or manipulation.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why Do People Believe That Bitcoin is Worthless?<\/strong><\/h2>\n\n\n\n<p>Some people believe Bitcoin is worthless because it has no intrinsic value and no institution backs it by something real.&nbsp;<\/p>\n\n\n\n<p>Bitcoin is also volatile and its price can fluctuate over a short time.&nbsp;<\/p>\n\n\n\n<p>Because of this new technology, many people also do fraudulent activities associated with it, which further leads to the belief that it is just a scam and too risky.&nbsp;<\/p>\n\n\n\n<p>Also, the absence of regulation is alien to people and they are rather afraid to give this new technology a chance.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Will Happen With Bitcoin’s Limited Supply if People Lose it?<\/strong><\/h2>\n\n\n\n<p>Bitcoin has a limited supply that will never exceed 21 million.&nbsp;<\/p>\n\n\n\n<p>This means that if people lose their Bitcoins, the supply of Bitcoins will decrease if we don’t recover them.&nbsp;<\/p>\n\n\n\n<p>This will make Bitcoin scarcer. The demand and prices could likely increase as fewer coins are available. So keep your private keys secure and back up your wallets so you don’t lose this valuable asset.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion: Bitcoin is Highly Divisible<\/strong><\/h2>\n\n\n\n<p>Bitcoin&#8217;s high divisibility makes it unique compared to traditional currencies, and it ensures that the cryptocurrency is practical for everyday use.&nbsp;<\/p>\n\n\n\n<p>Divisibility also helps to make Bitcoin more competitive with fiat currencies, particularly when it comes to transaction fees.&nbsp;<\/p>\n\n\n\n<p>Additionally, Bitcoin&#8217;s scarcity and the potential for high prices in the future make high divisibility crucial. Overall, Bitcoin&#8217;s divisibility is one of the key features that makes it a valuable and flexible currency.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bitcoins are more divisible than traditional currency. One Bitcoin is divisible up to a 100 million times to its smallest unit called satoshi.<\/p>\n","protected":false},"author":2,"featured_media":1432,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[95],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/235"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=235"}],"version-history":[{"count":30,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/235\/revisions"}],"predecessor-version":[{"id":4060,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/235\/revisions\/4060"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1432"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}