{"id":343,"date":"2022-11-20T21:54:14","date_gmt":"2022-11-20T20:54:14","guid":{"rendered":"https:\/\/securenest.org\/?p=343"},"modified":"2024-01-24T23:35:10","modified_gmt":"2024-01-24T22:35:10","slug":"bitcoin-wallet-address-generated","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/bitcoin-wallet-address-generated","title":{"rendered":"How Are Bitcoin Wallet Addresses Generated?"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/bitcoin-wallet-addresses-generated.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"Bitcoin wallet addresses generation methods.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/bitcoin-wallet-addresses-generated.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/bitcoin-wallet-addresses-generated-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/bitcoin-wallet-addresses-generated-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2022\/11\/bitcoin-wallet-addresses-generated-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>Bitcoin wallets use a pair of private and public keys to generate wallet addresses<\/li>\n\n\n\n<li>Bitcoin uses Public-Key Cryptography to encrypt and decrypt data for authenticity and privacy<\/li>\n\n\n\n<li>Private keys are randomly generated 256-bit hexadecimal numbers while public keys are generated mathematically using elliptic curve multiplication<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Are Bitcoin Addresses Generated?<\/strong><\/h2>\n\n\n\n<p>A public key <a href=\"https:\/\/securenest.org\/learn\/how-bitcoin-wallet-work\" data-type=\"post\" data-id=\"3020\" target=\"_blank\" rel=\"noopener\">generates Bitcoin wallet<\/a> addresses through the use of two cryptographic hashing algorithms.<\/p>\n\n\n\n<p>Bitcoin wallets are used to store Bitcoin.&nbsp;<\/p>\n\n\n\n<p>This is like a bank account where we hold our fiat money. If we want to access our money, we can access our bank account and can send or receive money.&nbsp;<\/p>\n\n\n\n<p>Bitcoin wallets work in the same way. As a bank account needs an account number so that it allocates money correctly, a Bitcoin wallet needs an address, too. These addresses are created by generating a private and public key.&nbsp;<\/p>\n\n\n\n<p>The private keys are 256-bit letters and numbers with alphanumeric characters randomly chosen if you create a Bitcoin wallet. The private key then creates a public key which is used to generate a wallet address.&nbsp;<\/p>\n\n\n\n<p>These two keys form a key pair mathematically related to each other. This way the derivation of the public key from the private key. The public key hashes into a wallet address.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">If you want to receive bitcoin<\/a> in your wallet, you always have to provide this wallet address to the sender. This entire process is a cryptographic method called &#8216;Public-Key Cryptography&#8217;. <\/p>\n\n\n\n<p>In the following article, we will look at how these cryptographic processes work.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why BTC Uses Public-Key Cryptography?<\/strong><\/h2>\n\n\n\n<p>Bitcoin uses Public-Key Cryptography.<\/p>\n\n\n\n<p>It is a more advanced encryption method allowing easy verification of authenticity.<\/p>\n\n\n\n<p>In comparison with symmetric encryption, Public-Key Cryptography is a method of asymmetric encryption.<\/p>\n\n\n\n<p>Instead of using only one key to decrypt data, <a href=\"https:\/\/csrc.nist.gov\/glossary\/term\/public_key_cryptography\" target=\"_blank\" rel=\"noreferrer noopener\">it uses two separate keys<\/a>.&nbsp;<\/p>\n\n\n\n<p>There is always a private key needed to decrypt data. With Public-Key Cryptography there is also a public key used. The public key is available to the public so anyone can use it to encrypt data. There is no need to send private keys to other persons.<\/p>\n\n\n\n<p>This could be another privacy risk. Someone could steal the private key, allowing this person to decrypt the data. With public keys, this problem does not happen. The public key encrypts data and anyone can use it. A private key decrypts this data.&nbsp;<\/p>\n\n\n\n<p>Only one person has the private key and should not share it with anyone. The private key allows the Bitcoin user to verify that he is the actual owner of the bitcoin stored in the wallet because only he has access to it.&nbsp;<\/p>\n\n\n\n<p>The entire process of creating Bitcoin wallet addresses starts with the creation of private keys. These keys then generate the public keys and the wallet addresses, too.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How is a Private Key Generated?<\/strong><\/h2>\n\n\n\n<p>A private key is a randomly generated <a href=\"https:\/\/www.oreilly.com\/library\/view\/mastering-bitcoin\/9781491902639\/ch04.html\" target=\"_blank\" rel=\"noreferrer noopener\">hexadecimal 256-bit number<\/a>.<\/p>\n\n\n\n<p>First, a number generator picks in the Bitcoin network a random decimal number between 1 and 2^256.<\/p>\n\n\n\n<p>It puts this large number through the SHA-256 algorithm (Secure Hash Algorithm with 256 bit length). This creates a private key in a hexadecimal format.<\/p>\n\n\n\n<p>Together with the digits from 0 to 9, it additionally uses the letters A to F. A hexadecimal digit can have 16 different values instead of only ten. A private key in this format looks similar to this:<\/p>\n\n\n\n<p>036ff283158711436176<\/p>\n\n\n\n<p>The randomly picked decimal number in the first step was further randomized by the algorithm and shortened to a usable length of 64 digits in a hexadecimal number format.&nbsp;<\/p>\n\n\n\n<p>The generated private key is the first step in the process of Bitcoin wallet address creation and is used to prove your ownership of the bitcoin within your wallet. It is an important key which every Bitcoin owner should secure as well as possible.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How is a Public Key Generated?<\/strong><\/h2>\n\n\n\n<p>A public key derives from a private key and connects mathematically to it.&nbsp;<\/p>\n\n\n\n<p>A private key also generates a corresponding public key. The generation of a public key is calculated by using elliptic curve multiplication.<\/p>\n\n\n\n<p>Elliptic curve multiplication (ECDSA, or Elliptic Curve Digital Signature Algorithm) is a mathematical process where the private key multiplies by a variable in an elliptic curve to produce an output.<\/p>\n\n\n\n<p>It uses a defined standard called &#8216;secp256k1&#8217;.&nbsp;<\/p>\n\n\n\n<p>This output is another variable (the public key). We can only do this process in one way, from the private key to the public key. But it is nearly impossible to reverse this calculation. This leads to an advantage for this method.<\/p>\n\n\n\n<p>With the <a href=\"https:\/\/en.bitcoin.it\/wiki\/Technical_background_of_version_1_Bitcoin_addresses\" target=\"_blank\" rel=\"noreferrer noopener\">private key generating<\/a> a corresponding public key, we can also use the public key for verification of the same data used by a public key. This way, we can share the public key with anyone, leaving the private key secret to the user.<\/p>\n\n\n\n<p>The public key can work as a proof that the user has the corresponding private key verifying his authenticity. And whoever has the private key can be verified as the owner of the bitcoin stored in the wallet.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How is a Bitcoin Address Finally Generated?<\/strong><\/h2>\n\n\n\n<p>A public key creates a Bitcoin address using hashing algorithms to shorten it and make it more readable.&nbsp;<\/p>\n\n\n\n<p>This address is used to send and receive cryptocurrencies like a bank account number.&nbsp;<\/p>\n\n\n\n<p>It compresses the public key to make it shorter and easier to read. Two algorithms do this, the already used <a href=\"https:\/\/learn.saylor.org\/mod\/book\/view.php?id=36353&amp;chapterid=18935\" target=\"_blank\" rel=\"noreferrer noopener\">SHA-256 and the RIPEMD160<\/a> (RACE Integrity Primitives Evaluation Message with 160-bit length).&nbsp;<\/p>\n\n\n\n<p>First, it hashes the public key with the SHA-256 for further security reasons. Adding now another randomly generated hash minimizes the risk of duplicates and makes reversing more likely impossible.<\/p>\n\n\n\n<p>Note that using the SHA-256 once is already considered being nearly impossible. After this process, the output is then <a href=\"https:\/\/medium.com\/coinmonks\/how-to-generate-a-bitcoin-address-step-by-step-9d7fcbf1ad0b\" target=\"_blank\" rel=\"noreferrer noopener\">hashed a second time<\/a> using the RIPEMD160 algorithm, known as double-hashing.<\/p>\n\n\n\n<p>This algorithm uses only 160 bits, which results in a shorter output. Shorter addresses are easier for everyday use.<\/p>\n\n\n\n<p>To make the address more readable and error-proof, a so-called &#8216;Base58 Check&#8217; is performed to encode the Bitcoin address. This encoding displays it by using more letters of the alphabet and omitting characters, which could lead to mistakes.<\/p>\n\n\n\n<p>The characters 0 (zero), O (capital o), l (lower L) and I (capital i) are omitted because in some fonts they are displayed identically. If someone would read or type such characters, there would arise a high probability of errors.<\/p>\n\n\n\n<p>The result of this entire process is the final address format, which then can be used for sending and receiving bitcoin. These addresses can come in different formats, like bech32, P2PKH or P2SH addresses. Their formats specify their length or their starting characters.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Many Addresses Can a Bitcoin Wallet Have?<\/strong><\/h2>\n\n\n\n<p>If you can create addresses easily, then the question arises how much of them you could have.&nbsp;<\/p>\n\n\n\n<p>In your wallet, you can have as many addresses as you want.&nbsp;<\/p>\n\n\n\n<p>This sounds hard to believe because everyone could just create endless addresses. There is no problem in doing it because the number of addresses is nearly endless and you won’t ever have to think of a limit.&nbsp;<\/p>\n\n\n\n<p>A public key creates a corresponding address with the RIPEMD160 hash. With his 160-bit, there are 2^160 addresses possible. No one can imagine this number, but it is so big that it is practically infinite.&nbsp;<\/p>\n\n\n\n<p>A wallet comes with 100 pre-generated addresses, but if you use them all, your wallet can just generate new ones.<\/p>\n\n\n\n<p>Practically the wallet provider you choose could apply a limit to the number of addresses you can use. But apart from that, a wallet can generate addresses without a limit in amount.&nbsp;<\/p>\n\n\n\n<p>The only thing you should keep track of is that with a significant amount of addresses, it is getting harder to track them all.&nbsp;<\/p>\n\n\n\n<p>Do keep that in mind and try to track them all so you don’t get the problem of losing access to them because you forgot the correct address number.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What’s the Difference Between a Bitcoin Wallet, a Key, and a Wallet Address?<\/strong><\/h2>\n\n\n\n<p>Address, key or wallet are three important terms for crypto assets.&nbsp;<\/p>\n\n\n\n<p>An <a href=\"https:\/\/en.bitcoinwiki.org\/wiki\/Bitcoin_address\" target=\"_blank\" rel=\"noreferrer noopener\">address is the unique identifier<\/a> used by a wallet similar to a bank account number.&nbsp;<\/p>\n\n\n\n<p>We use it as the address for every transaction within crypto wallets. A key is another unique number associated with an address and can access the funds in the wallet.&nbsp;<\/p>\n\n\n\n<p>A wallet is the actual interface to store, receive, or send bitcoin. There are different types of wallets, like hardware wallets, paper wallets or software wallets.&nbsp;<\/p>\n\n\n\n<p>The key difference to all these terms is that we use the address as the receiving address for the funds, the key provides access to those funds, and the wallet stores the funds.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\"><strong>FAQ<\/strong><\/h1>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Many Crypto Keys and Addresses Can Be Generated?<\/strong><\/h2>\n\n\n\n<p>We can generate Bitcoin keys and addresses in a nearly unlimited number.&nbsp;<\/p>\n\n\n\n<p>Because of the RIPEMD160 hash function, 2^160 addresses are possible.&nbsp;<\/p>\n\n\n\n<p>This is an insane number and is so much that no person will ever have to think about a limit of keys or addresses.&nbsp;<\/p>\n\n\n\n<p>Even if you use one address per Bitcoin transaction, you never will get to a limit. With your wallet software, you can generate as many addresses as you want without restrictions. This ability secures Bitcoin.&nbsp;<\/p>\n\n\n\n<p>You can further <a href=\"https:\/\/securenest.org\/learn\/delete-wallet-account\" target=\"_blank\" rel=\"noopener\">manage multiple accounts on one wallet<\/a> easily. Another reason is that this way you can maximize your anonymity.&nbsp;<\/p>\n\n\n\n<p>We can trace every address in the Bitcoin blockchain network, so if someone knows your address because you have used it in a transaction, the other person can check how much bitcoin there is on this address.&nbsp;<\/p>\n\n\n\n<p>If you use multiple addresses, you can hide your overall funds better from other people.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why Does Bitcoin Generate New Addresses?<\/strong><\/h2>\n\n\n\n<p>The Bitcoin protocol allows for this kind of generation because of different reasons.&nbsp;<\/p>\n\n\n\n<p>The most important reason is privacy.&nbsp;<\/p>\n\n\n\n<p>When a new Bitcoin address is used to receive or send funds, it doesn’t show the total number of bitcoins a user might have.&nbsp;<\/p>\n\n\n\n<p>Every address acts as a separate &#8216;bank account&#8217; with their own funds. This makes it difficult to track all the funds a person could have. A separate address is useful if you want to hide your other funds.&nbsp;<\/p>\n\n\n\n<p>If you generate a new wallet address, you are further protected against theft or fraud. If someone could get access to your address, then your other addresses would remain safe and you wouldn’t lose all your money.&nbsp;<\/p>\n\n\n\n<p>Wallet software does this automatically for you known as hd wallets (hierarchical deterministic). If you want to receive bitcoins, you always get a new address generated by your wallet.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Can the Same Bitcoin Address Be Generated Twice?<\/strong><\/h2>\n\n\n\n<p>Theoretically, a Bitcoin address could be generated twice, but because of the hashing process, the likelihood is so small that it is practically impossible.&nbsp;<\/p>\n\n\n\n<p>These algorithms create hashes from inputs with an extremely high number of potential outputs.&nbsp;<\/p>\n\n\n\n<p>This process is further done twice, so the same output is nearly impossible to achieve. Besides this, a public key is used for every address to minimize the possibility of duplication.&nbsp;<\/p>\n\n\n\n<p>The address derives from the public key, which adds another step into the process to create an address.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion: How Bitcoin Wallet Addresses are Generated?<\/strong><\/h2>\n\n\n\n<p>Bitcoin wallet addresses are generated through a complex cryptographic process using private and public keys.&nbsp;<\/p>\n\n\n\n<p>The private key, which is a randomly generated 256-bit hexadecimal number, generates a public key using elliptic curve multiplication.&nbsp;<\/p>\n\n\n\n<p>The public key is then hashed using SHA-256 and RIPEMD160 algorithms to create a wallet address, which is used to send and receive bitcoin.&nbsp;<\/p>\n\n\n\n<p>The use of Public-Key Cryptography, a method of asymmetric encryption, adds an extra layer of security by allowing easy verification of authenticity without the need to share private keys.&nbsp;<\/p>\n\n\n\n<p>It is crucial for Bitcoin users to secure their private keys to prove ownership of their bitcoin.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wallet addresses are used to send and receive cryptocurrency. We will show you how these crypto addresses are generated through hashing algorithms.<\/p>\n","protected":false},"author":2,"featured_media":1428,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[101],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/343"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=343"}],"version-history":[{"count":17,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/343\/revisions"}],"predecessor-version":[{"id":5633,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/343\/revisions\/5633"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1428"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=343"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=343"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=343"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}