{"id":513,"date":"2023-01-14T20:05:59","date_gmt":"2023-01-14T19:05:59","guid":{"rendered":"https:\/\/securenest.org\/?p=513"},"modified":"2024-01-24T23:35:09","modified_gmt":"2024-01-24T22:35:09","slug":"how-long-are-bitcoin-addresses","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/how-long-are-bitcoin-addresses","title":{"rendered":"How Long Are Bitcoin Addresses [Bitcoin Address Formats]?"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/01\/how-long-are-bitcoin-addresses.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"A man in a suit standing next to a pile of bitcoins, showcasing their value and wealth.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/01\/how-long-are-bitcoin-addresses.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/01\/how-long-are-bitcoin-addresses-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/01\/how-long-are-bitcoin-addresses-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/01\/how-long-are-bitcoin-addresses-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>A Bitcoin wallet address can have between 34 to 62 alphanumeric characters<\/li>\n\n\n\n<li>The characters &#8220;0&#8221;, &#8220;o&#8221;, &#8220;l&#8221;, and &#8220;i&#8221; are omitted from Bitcoin addresses to avoid confusion<\/li>\n\n\n\n<li>Understanding the length and format of Bitcoin addresses is essential for safe transactions<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">How Long is a Bitcoin Address<strong>?<\/strong><\/h2>\n\n\n\n<p>A <a href=\"https:\/\/securenest.org\/learn\/what-are-bitcoin-addresses\" data-type=\"post\" data-id=\"2733\" target=\"_blank\" rel=\"noopener\">Bitcoin wallet address<\/a> is between 34-62 alphanumeric characters. <\/p>\n\n\n\n<p>Most resources claim that there are up to about 35 characters, which is not completely correct.&nbsp;<\/p>\n\n\n\n<p>The newer address types of <a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">Bitcoin<\/a> can have much more characters which we will explain in this article. They don&#8217;t use all the characters available. <\/p>\n\n\n\n<p>The characters 0 (zero), O (capital o), l (lower L) and I (capital i) are omitted because in some fonts they are displayed identically. Wallet addresses are long and inconvenient, so it is possible to convert them into QR codes.&nbsp;<\/p>\n\n\n\n<p>Bitcoin wallet addresses are generated randomly, but they always start with the characters “1”, “3” or “bc1”. This <a href=\"https:\/\/securenest.org\/learn\/bitcoin-address-start-with-2\" target=\"_blank\" rel=\"noopener\">prefix in the Bitcoin address<\/a> is an identifier of its type.&nbsp;<\/p>\n\n\n\n<p>The reason for this is that these addresses use different format types for Bitcoin payments and were generated under different circumstances. These crypto addresses always undergo a checksum calculation, which verifies if they are valid.&nbsp;<\/p>\n\n\n\n<p>Another important factor is the case sensitivity of these addresses. They can include lower- and uppercase characters, which have to be typed in correctly.<\/p>\n\n\n\n<p>If you not only understand the pure length of Bitcoin addresses but also their formats, you’ll be able to use them safely for your transactions.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Different Bitcoin Address Formats<\/strong><\/h2>\n\n\n\n<p>Besides the character length of an address, it is important to note that addresses can be generated with specific prefixes depending on the format used.&nbsp;<\/p>\n\n\n\n<p>This way you are not only able to identify the kind of address, but they also offer distinct advantages.&nbsp;<\/p>\n\n\n\n<p>They are generally divided into 4 groups of addresses. Starting with the oldest address, we have Legacy, Script, SegWit and Taproot.&nbsp;<\/p>\n\n\n\n<p>These four types were developed over time because Bitcoin needed to adapt to its environment and increased use. The last two types, SegWit and Taproot, are based on the same encoding scheme, called Bech32.&nbsp;<\/p>\n\n\n\n<p>This allows them to be faster and more secure and efficient. Your address type may depend on the service you use. Especially the two newer types are not supported by all exchanges and wallets.&nbsp;<\/p>\n\n\n\n<p>In the end, all addresses work on the same concept of Bitcoin and its algorithms.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>P2PKH Address (Legacy Address)<\/strong><\/h2>\n\n\n\n<p>This is the <a href=\"https:\/\/en.bitcoinwiki.org\/wiki\/Pay-to-Pubkey_Hash\" target=\"_blank\" rel=\"noreferrer noopener\">original address format<\/a> of Bitcoin.&nbsp;<\/p>\n\n\n\n<p>It means paying to the public key hash of the recipient and locking bitcoins to it.&nbsp;<\/p>\n\n\n\n<p>A P2PKH, or Pay-to-Public-Key-Hash address, always starts with a “1”. This address has a slight disadvantage over the other addresses.&nbsp;<\/p>\n\n\n\n<p>The P2PKH output can be unlocked (spent) with the <a href=\"https:\/\/www.frontiersin.org\/articles\/10.3389\/fbloc.2019.00007\/full\" target=\"_blank\" rel=\"noreferrer noopener\">corresponding public key and digital signature created by the private key<\/a>. This format doesn’t support multisig. The SegWit standard doesn’t allow the usage of these addresses anymore.&nbsp;<\/p>\n\n\n\n<p>This is good to know if you use a wallet with this newer standard. This lets this legacy address disappear and all brand new Bitcoin addresses aren’t created in this format anymore.&nbsp;<\/p>\n\n\n\n<p>If you want to send a transaction from this format to a newer SegWit type, the <a href=\"https:\/\/iq.opengenus.org\/p2pkh\/\" target=\"_blank\" rel=\"noreferrer noopener\">fees are relatively high<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>P2SH Address (Script Address)<\/strong><\/h2>\n\n\n\n<p>The P2SH, or Pay-to-Script-Hash address, is a newer type than the P2PKH but has the same structure.&nbsp;<\/p>\n\n\n\n<p>This address always starts with a “3”.&nbsp;<\/p>\n\n\n\n<p>This new address type was introduced because of the “SegWit” upgrade. In this upgrade, the transaction time of Bitcoin was lowered.<\/p>\n\n\n\n<p>This lower transaction time was achieved with a reduction of the transaction data needed to be included in a block. This led to lower fees for transactions with P2SH addresses. It allows users to use a single address for multiple transactions.&nbsp;<\/p>\n\n\n\n<p>Instead of paying to 3 different Bitcoin addresses, all transactions can be received into one address. This is especially helpful for businesses which need to get a lot of transactions from customers with the ability to monitor it with little organization.&nbsp;<\/p>\n\n\n\n<p>A typical example would be a BTC address to receive a donation from many people. They could gather everything in one place and then transfer the funds to other places from there.&nbsp;<\/p>\n\n\n\n<p>Having one address in a transaction instead of multiple ones reduces the amount of bytes needed to be stored for this transaction. Because of the same structure, it can be <a href=\"https:\/\/developer.bitcoin.org\/devguide\/transactions.html\" target=\"_blank\" rel=\"noreferrer noopener\">converted to a P2PKH address<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>P2WPKH Address (SegWit Address)<\/strong><\/h2>\n\n\n\n<p>The P2WPKH, or Pay-to-Witness-Public-Key-Hash address, was introduced with the SegWit Upgrade in Bitcoin.&nbsp;<\/p>\n\n\n\n<p>This is a more efficient address format with the use of Bech32.&nbsp;<\/p>\n\n\n\n<p>The prefix of this type is “bc1q”. This type introduced reduced transaction fees and faster Bitcoin network transactions by allowing to separate the signature data from the remaining transaction data. It provides more security against input errors.&nbsp;<\/p>\n\n\n\n<p>These addresses are not case sensitive and use code to correct errors. This helps to secure the users even more from potential mistakes. Unlike traditional addresses, these types contain only the single public key hash.&nbsp;<\/p>\n\n\n\n<p>It is possible because users have to provide proof of ownership by the corresponding private key in order to process transactions. This improves security and protects privacy because less data has to be sent.&nbsp;<\/p>\n\n\n\n<p>This allows faster transactions, lower fees and improved anonymity because of less data. The smaller size of data allows more of these transactions to be put into one block. This is more efficient and cost-effective.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>P2TR Address (Taproot Address)<\/strong><\/h2>\n\n\n\n<p>P2TR, or Pay-to-Taproot, is the last and newest and most advanced type of Bitcoin address that provides an extra layer of security and privacy.&nbsp;<\/p>\n\n\n\n<p>It was <a href=\"https:\/\/river.com\/learn\/what-is-taproot\/\" target=\"_blank\" rel=\"noreferrer noopener\">introduced at the end of 2021<\/a>.&nbsp;<\/p>\n\n\n\n<p>This type starts with the prefix “bc1p”. With Taproot, Schnorr Signatures were implemented, which has some advantages over the currently used ECDSA (Elliptic Curve Digital Signature Algorithm).&nbsp;<\/p>\n\n\n\n<p>The biggest one is that it allows for key aggregation. Multiple parties can sign a transaction by combining their public keys to one aggregated key. They all need to sign the transaction.&nbsp;<\/p>\n\n\n\n<p>It is not possible to differentiate between this multisig and single signature transaction. This increases privacy, as now one public key could be generated by multiple users instead of only one.&nbsp;<\/p>\n\n\n\n<p>This aggregation further allows to verify these signatures in batches which reduces times. Taproot is more efficient, private, and provides faster verification processes. It doesn’t replace the current ECDSA, so it will <a href=\"https:\/\/en.bitcoin.it\/wiki\/Bech32_adoption\" target=\"_blank\" rel=\"noreferrer noopener\">take time to be adapted<\/a> by the whole blockchain.&nbsp;<\/p>\n\n\n\n<p>Both SegWit and Taproot start with the prefix “bc1” because they both support Bech32 encoding.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Bech32 Address Format<\/strong><\/h2>\n\n\n\n<p>This address format starts with a “bc1”.&nbsp;<\/p>\n\n\n\n<p>It is an encoding scheme used by SegWit and Taproot.&nbsp;<\/p>\n\n\n\n<p>It comprises 42-62 characters. This format was introduced with the native SegWit. It is designed for even more block space efficiency, which makes it the <a href=\"https:\/\/en.bitcoin.it\/wiki\/Bech32\" target=\"_blank\" rel=\"noreferrer noopener\">preferred address type<\/a> for today’s Bitcoin transactions.&nbsp;<\/p>\n\n\n\n<p>They are more efficient and provide lower fees than the older addresses. Not all Bitcoin wallets or crypto exchanges support this new type format yet. Another advantage of this type is the use of only lowercase letters compared to the other two types.<\/p>\n\n\n\n<p>It further excludes the number “1” and the letters “o”, “i” and “b”. This makes it less prone to typing errors. Before Bech32, Bitcoin used the Base58 encoding scheme only. This is, of course, still used by the older address types.&nbsp;<\/p>\n\n\n\n<p>This older encoding scheme uses a mixed case letter and is more likely prone to typing errors. With Bech32, addresses with more characters were introduced. The two older addresses Legacy and Script comprise 34 characters.&nbsp;<\/p>\n\n\n\n<p>SegWit addresses increased the length to 42 characters. The newest type, Taproot, even comprises 62 characters.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">FAQ<\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Can a Bitcoin Address Have 42 Characters?<\/strong><\/h2>\n\n\n\n<p>Yes, a Bitcoin address can be 42 characters long.&nbsp;<\/p>\n\n\n\n<p>This question arises often because many resources state that every address can have up to about 26-35 alphanumeric characters.&nbsp;<\/p>\n\n\n\n<p>This leads to people thinking that if they have a longer address, then maybe something is not correct. The older address type has a limit of 34 digits. The newer types introduced more digits. 42 characters are the length of the SegWit address.&nbsp;<\/p>\n\n\n\n<p>If you see an address with this many digits and with the prefix “bc1q” then you know that this is a SegWit address. There is no reason to be afraid in such a case.&nbsp;<\/p>\n\n\n\n<p>This address even means that you are using a more modern type of address with more security and efficiency. Most wallets provide you automatically with this type of address instead of the legacy ones.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Does a BTC Address Look Like?<\/strong><\/h2>\n\n\n\n<p>A Bitcoin address contains a string of alphanumeric characters that is unique.&nbsp;<\/p>\n\n\n\n<p>A BTC address looks for example like this: bc1qmhcs7eczvqzklrg8feipbmar32frgjbmsdg3qt<\/p>\n\n\n\n<p>This public address is unique and is used to send and receive transactions (note that this address was randomly picked so don’t use it for anything!).<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Many Characters is a Bitcoin Hash?<\/strong><\/h2>\n\n\n\n<p>A Bitcoin hash has 64 characters.&nbsp;<\/p>\n\n\n\n<p>It is 256 bits long determined by the SHA256 algorithm used by Bitcoin.&nbsp;<\/p>\n\n\n\n<p>It differs from an address and is a unique string of characters as well. Addresses result from this hash in the cryptographic process. The length is fixed and is not dependent on the input.&nbsp;<\/p>\n\n\n\n<p>No matter how much information is put into the hashing process, the result has always the same fixed length. This predictable size of the result is one of the reasons it is so popular to use for cryptography and this cryptocurrency.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion: How Long is a Bitcoin Address?<\/h2>\n\n\n\n<p>A Bitcoin wallet address can have between 34 to 62 alphanumeric characters. The newer address types have more characters compared to the old ones. The characters &#8220;0&#8221;, &#8220;o&#8221;, &#8220;l&#8221;, and &#8220;i&#8221; are omitted to avoid confusion. Understanding the length and format of Bitcoin addresses is essential for safe transactions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Bitcoin address can be used to send and receive Bitcoin. Each address is long and typically composed of 34-62 alphanumeric characters.<\/p>\n","protected":false},"author":2,"featured_media":1410,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[92],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/513"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=513"}],"version-history":[{"count":16,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/513\/revisions"}],"predecessor-version":[{"id":4214,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/513\/revisions\/4214"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1410"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=513"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=513"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=513"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}