{"id":621,"date":"2023-02-20T08:21:17","date_gmt":"2023-02-20T07:21:17","guid":{"rendered":"https:\/\/securenest.org\/?p=621"},"modified":"2024-01-24T23:35:06","modified_gmt":"2024-01-24T22:35:06","slug":"nft-monkey-bored-ape-yacht-club","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/nft-monkey-bored-ape-yacht-club","title":{"rendered":"What is an NFT Monkey? Bored Ape Yacht Club NFTs Explained!"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/02\/nft-monkey-bored-ape-yacht-club.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"An NFT monkey illustration.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/02\/nft-monkey-bored-ape-yacht-club.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/02\/nft-monkey-bored-ape-yacht-club-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/02\/nft-monkey-bored-ape-yacht-club-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/02\/nft-monkey-bored-ape-yacht-club-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>Bored Apes, part of the Bored Ape Yacht Club NFT collection, have become the most popular NFT monkeys<\/li>\n\n\n\n<li>Bored Apes are single NFTs known for their unique art style, featuring cartoon apes with various poses and traits, and their prices have skyrocketed<\/li>\n\n\n\n<li>The Bored Ape Yacht Club&#8217;s NFTs were created by Yuga Labs, a team of four individuals who developed the concept of an exclusive club<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is an NFT Monkey?<\/strong><\/h2>\n\n\n\n<p>NFTs with monkeys are mostly known as Bored Apes from the NFT collection “Bored Ape Yacht Club”.&nbsp;<\/p>\n\n\n\n<p>They have <a href=\"https:\/\/securenest.org\/learn\/nft-applications\" data-type=\"post\" data-id=\"5744\" target=\"_blank\" rel=\"noopener\">influenced the NFT world as the most popular NFT collection<\/a>. Since then they also exploded in value and all people in the NFT space know what they are. <\/p>\n\n\n\n<p>They were minted on Ethereum’s blockchain, which enables them to be transferred and exchanged with other people through the cryptocurrency ETH in a decentralized network.&nbsp;<\/p>\n\n\n\n<p>NFTs boomed in 2021, which was the same year the <a href=\"https:\/\/wiki.alquds.edu\/?query=Bored_Ape_Yacht_Club\" target=\"_blank\" rel=\"noopener\">Bored Apes were launched<\/a>. This collection of 10,000 apes in cartoon look has become the pioneer in NFT, similar to Bitcoin for cryptocurrency.&nbsp;<\/p>\n\n\n\n<p>But in contrast to Bitcoin, the Bored Apes were not the first NFTs or even the first “10k NFT” collection, which collections with 10,000 pieces are called. Another famous collection who pioneered with this amount of NFTs were CryptoPunks.&nbsp;<\/p>\n\n\n\n<p>CryptoPunks were released as NFTs were relatively new and unknown a few years before the Bored Apes. The monkey had just the luck that they started together with the massive NFT hype.&nbsp;<\/p>\n\n\n\n<p>Because of the hype about monkeys in the NFT space, many tried to copycat them with other NFT monkeys which is why people search for “NFT monkeys” to get a cheaper alternative.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Are Bored Ape NFTS?<\/strong><\/h2>\n\n\n\n<p>Bored Apes are single <a href=\"https:\/\/securenest.org\/learn\/what-is-nft\" data-type=\"post\" data-id=\"616\" target=\"_blank\" rel=\"noopener\">NFTs<\/a> as a part of the Bored Ape Yacht Club collection. <\/p>\n\n\n\n<p>Launched back in 2021, they were sold for about $200 each.&nbsp;<\/p>\n\n\n\n<p>Prices skyrocketed up to $400,000 in their peak. They feature cartoon apes in various poses and traits, often accompanied by humorous captions. They became a sudden sensation in the NFT world and quickly gained popularity for their unique art style.&nbsp;<\/p>\n\n\n\n<p>The limited nature of these tokens makes them desirable to collectors. Bored ape owners hold one of the rarest and most desirable pieces of digital art available. It was so hyped that even prominent people bought these NFTs.&nbsp;<\/p>\n\n\n\n<p>This made owning a bored ape a privilege. A BAYC NFT is mostly used as a twitter profile picture to showcase them to the community.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Who Created the BAYC NFT From the Bored Ape Yacht Club?<\/strong><\/h2>\n\n\n\n<p>The Bored Ape Yacht Club’s NFTs were <a href=\"https:\/\/www.yuga.com\/about\" target=\"_blank\" rel=\"noopener\">created by Yuga Labs<\/a>.&nbsp;<\/p>\n\n\n\n<p>Yuga Labs consists of four people known under the pseudonyms Gordon Goner, Gargamel, Sass and Emperor Tomato Ketchup.&nbsp;<\/p>\n\n\n\n<p>Gordon Goner and Gargamel are the co-founders with the other two helping from the technical development side. In the growing phase of Yuga Labs, all members revealed their real identity.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/twitter.com\/GordonGoner\" target=\"_blank\" rel=\"noopener\">Gordon Goner<\/a> is Wylie Aronov, <a href=\"https:\/\/twitter.com\/CryptoGarga\" target=\"_blank\" rel=\"noopener\">Gargamel<\/a> is Greg Solano, <a href=\"https:\/\/twitter.com\/sassbayc\" target=\"_blank\" rel=\"noopener\">Sass<\/a> is Zeshan Ali and <a href=\"https:\/\/twitter.com\/TomatoBAYC\" target=\"_blank\" rel=\"noopener\">Emperor Tomato Ketchup<\/a> is Kerem Atalay. The founders had an idea of a bar that was only accessible by members of an exclusive club.&nbsp;<\/p>\n\n\n\n<p>Apes should be the members and the concept of BAYC NFTs was born. The club only allows members who can prove their worth and loyalty by possessing an original Bored Ape.&nbsp;<\/p>\n\n\n\n<p>One thing most people don’t know is that the Bored Apes weren’t designed by the founders of Yuga Labs but <a href=\"https:\/\/www.rollingstone.com\/culture\/culture-features\/seneca-bored-ape-yacht-club-digital-art-nfts-1280341\/\" target=\"_blank\" rel=\"noopener\">by the artist Seneca<\/a>. She designed the main characters with several traits.&nbsp;<\/p>\n\n\n\n<p>They were further co-artists designing backgrounds and further details for the apes.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why is the Bored Ape NFT Collection So Valuable?<\/strong><\/h2>\n\n\n\n<p>Today, Bored Apes are a status symbol.&nbsp;<\/p>\n\n\n\n<p>This gives them value. Many things in our life give value through branding, desire or perception rather than a real utility.&nbsp;<\/p>\n\n\n\n<p>We have things like expensive cars, real estate, watches or clothing. Nothing of it is necessary to be that expensive, but it is something successful people want to invest in to show their success.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/miamioh.edu\/fsb\/news\/2022\/01\/NFTs-What-they-are,-and-what-they-could-be.html\" target=\"_blank\" rel=\"noopener\">NFTs can work even better as a status symbol<\/a> because of its digital benefits compared to physical goods. In the virtual world, it is a lot easier to showcase success to a sizable community as we can on Twitter or Facebook.&nbsp;<\/p>\n\n\n\n<p>If you use a popular NFT as your avatar, then millions of people can see it. Successful NFTs are like successful art. Many factors have to be met to make a difference between success and ordinariness.&nbsp;<\/p>\n\n\n\n<p>To be successful depends on if celebrities are involved, the general appeal for the mainstream or the utility the art can provide. The Bored Ape collection fulfilled all these criteria.&nbsp;<\/p>\n\n\n\n<p>They started to be hyped by known people and celebrities even bought these NFTs. This got the attention of the NFT community and the mainstream. This already gave this collection immense value because it was desired by many.&nbsp;<\/p>\n\n\n\n<p>Owners also get full commercial rights on these NFTs so they can use it to push their own businesses. This is not the general use case, and even some NFT creators prohibit commercial use.&nbsp;<\/p>\n\n\n\n<p>Aside from that, the Bored Apes NFTs give some real utility for their owners and make them even more desirable.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Makes Bored Apes So Beneficial to Its Owners?<\/strong><\/h2>\n\n\n\n<p>The Bored Ape Yacht Club is an actual club which provides its owner a unique platform for exclusive perks.&nbsp;<\/p>\n\n\n\n<p>The founders have combined the NFT with real physical advantages, which is part of their success.&nbsp;<\/p>\n\n\n\n<p>It provides members a variety of status symbols, including additional NFTs, real-world events or limited edition merchandise. Every owner of an Ape gets access to an exclusive discord server where all owners can connect with each other.&nbsp;<\/p>\n\n\n\n<p>Because some owners are prominent people, you can have the chance to chat with them directly. Another benefit is that members get access to limited merchandise articles which can be bought only by them.&nbsp;<\/p>\n\n\n\n<p>One of the most sought-after features are the real-world events, which can be <a href=\"https:\/\/hbr.org\/2021\/11\/how-nfts-create-value\" target=\"_blank\" rel=\"noopener\">accessed only by members<\/a>. If you want to show success and buy one of these NFTs, this is the place-to-be.&nbsp;<\/p>\n\n\n\n<p>The last major perk you get is that you also get further NFTs from the secondary collections, like the Bored Ape Kennel Club or the Mutant Ape Yacht Club. These NFTs are also desired and members get exclusive access to them.&nbsp;<\/p>\n\n\n\n<p>All these features give an incredible value for those looking for an exclusive experience.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How BAYC NFTs Use the Ethereum Blockchain?<\/strong><\/h2>\n\n\n\n<p>A Bored Ape Yacht Club NFT is built on the Ethereum blockchain.&nbsp;<\/p>\n\n\n\n<p>Like every other Non-Fungible Token, they have been tokenized and can be bought and sold with ether.&nbsp;<\/p>\n\n\n\n<p>This collection is sold on the popular NFT marketplace OpenSea, where you can still buy them today. Because they were minted originally on Ethereum, they cannot be bought with another cryptocurrency aside from ether.&nbsp;<\/p>\n\n\n\n<p>If an owner wants to trade his NFT, he needs to use OpenSea and Ethereum. Because of the success of this collection, the founders created their own cryptocurrency based on Ethereum’s ERC-20 standard, called an “Ape Coin”.&nbsp;<\/p>\n\n\n\n<p>This currency will be used for the other products created by Yuga Labs. The ERC-20 standard was developed by the Ethereum developers to offer a functioning ecosystem with decentralized applications (dApps).&nbsp;<\/p>\n\n\n\n<p>Yuga Labs is already building a metaverse called “Otherside” which also builds up on this ecosystem. With their own currency, they will provide a metaverse where users will buy land for their apes.&nbsp;<\/p>\n\n\n\n<p>The possibilities are endless and this product shows how the blockchain can be used.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why Are There 10,000 Bored Apes?<\/strong><\/h2>\n\n\n\n<p>Collections of 10,000 NFTs are the golden standard in the NFT world.&nbsp;<\/p>\n\n\n\n<p>Every excellent collection needs to have this amount of NFTs and they even have their own term, “10k NFTs”.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/docs.google.com\/document\/u\/0\/d\/1iSBfXwMhRVUfoqcCLi5WHDNZemt8_FYlUW5-H-i08cs\/edit\" target=\"_blank\" rel=\"noopener\">#28 &#8211; How much does it cost to create 10,000 NFTs?<\/a><\/p>\n\n\n\n<p>CryptoPunks pioneered with this amount and set this standard. One could ask why so many NFTs are necessary. It seems like a lot of work to design this amount. Because of this, such collections are created with the help of algorithms.&nbsp;<\/p>\n\n\n\n<p>There are specialized services called NFT generators which automatically create different variations based on the traits you provide. The algorithm takes all single traits and combines them in all variants.&nbsp;<\/p>\n\n\n\n<p>Therefore, you only need to design the main avatar and the single traits which need to be saved as separate layers or files.&nbsp;<\/p>\n\n\n\n<p>Compared to physical art, you can create such a collection a lot faster and this amount can provide you more income if you are successful compared to selling a collection of only a dozen pieces.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Much Does a Bored Ape Avatar Cost?<\/strong><\/h2>\n\n\n\n<p>Today, Bored Apes are <a href=\"https:\/\/opensea.io\/collection\/boredapeyachtclub?search[eventTypes][0]=AUCTION_SUCCESSFUL\" target=\"_blank\" rel=\"noopener\">listed with a floor price of 76 ETH<\/a>, which amounts to $130,000 (Feb. 2023).&nbsp;<\/p>\n\n\n\n<p>Current prices go up to 10,000 ETH, which amounts to nearly $17 million.&nbsp;<\/p>\n\n\n\n<p>These are only offers, but they show how much value these NFTs provide. The most expensive sale was recorded at Sotheby’s as an auction where the <a href=\"https:\/\/twitter.com\/Sothebysverse\/status\/1453042450788982794\" target=\"_blank\" rel=\"noopener\">Bored Ape #8817<\/a> was sold for $3.4 million.&nbsp;<\/p>\n\n\n\n<p>These prices seem insane, but Bored Apes are not the only NFTs selling for such prices. A lot of other collections are sold for high prices, too. This is just how it can be with art. One picture can be worth next to nothing and another one can be worth millions.&nbsp;<\/p>\n\n\n\n<p>This all depends on the circumstances of each design. The more unique and limited a design is, the more likely it will have a higher price tag. NFTs meet these criteria as their technology allows them to be unique and therefore limited.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/docs.google.com\/document\/u\/0\/d\/1-oTBX3896uut6cH8LJaqsq0fUPr0zeUxC8UvITG9H9M\/edit\" target=\"_blank\" rel=\"noopener\">#29 &#8211; How much does it cost to create an NFT?<\/a><\/p>\n\n\n\n<p>With an NFT, there always exists just one item. No one else can have a copy. This case is a great example that this technology can provide immense value.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is the Bored Ape Kennel Club and Mutant Ape NFT?<\/strong><\/h2>\n\n\n\n<p>The outstanding success of the Bored Apes led to additional collections created by their founders.&nbsp;<\/p>\n\n\n\n<p>The two collections are the Bored Ape Kennel Club and the Mutant Ape Yacht Club.&nbsp;<\/p>\n\n\n\n<p>Both collections used the blockchain technology in a specific way and showed how we can use it for further possibilities. The Bored Ape Kennel Club was created shortly after the original collection and provided all owners a new NFT for free.&nbsp;<\/p>\n\n\n\n<p>It displays a dog with the same look as its corresponding ape. Because every owner can be identified through the blockchain data, it was easy to create a new NFT and provide it to these owners.&nbsp;<\/p>\n\n\n\n<p>This shows how you can use the blockchain in a way to provide an owner with further products without hassle or needing additional data. This collection also has 10,000 NFTs, one Kennel per Bored Ape.&nbsp;<\/p>\n\n\n\n<p>The second collection with the Mutant Apes comprises 20,000 NFTs. When this collection was created, half of it was sold through a marketplace and the other half provided a special feature.&nbsp;<\/p>\n\n\n\n<p>All owners of the Bored Apes got the possibility of minting a new NFT with a “mutant serum” in different rarity categories. The owners could use this serum to mint a mutant version of their Bored Apes through a smart contract.&nbsp;<\/p>\n\n\n\n<p>This changed the look of the Bored Ape and was created in the form of a new Mutant Ape which got the owners another NFT. This shows what possibilities this technology can provide for the art or gaming sector.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Copycat NFT Monkey Art<\/strong><\/h2>\n\n\n\n<p>The Bored Apes led to other collections artists created to repeat the success of them.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/docs.google.com\/document\/u\/0\/d\/18WEHE41a-qGtiWqDBBm3lHsZMmRBpO9SDT3mpwbJyDQ\/edit\" target=\"_blank\" rel=\"noopener\">#21 &#8211; What happens if you screenshot an NFT?<\/a><\/p>\n\n\n\n<p>Other collections with monkeys are “awmonks” or “onchainmonkeys” which also provide monkeys as their main character.&nbsp;<\/p>\n\n\n\n<p>These collections are inspired by the Bored Apes but provide their own design. In the past, there were also copycats which copied the Bored Apes and just mirrored them. The original Bored Apes look to the right, the copycatted version looks to the left.&nbsp;<\/p>\n\n\n\n<p>Yuga Labs sued the artists, but they even tried to copy the collection on further marketplaces. This shows the legal aspects in terms of copyrights in the NFT world.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/docs.google.com\/document\/u\/0\/d\/17FeeaUoCnoYcKfyBQcsyq5t0dIX4xVgLVmWhIgm_-bc\/edit\" target=\"_blank\" rel=\"noopener\">#22 &#8211; Is it illegal to screenshot an NFT and could you get sued?<\/a><\/p>\n\n\n\n<p>Even if NFTs are just digitally created assets, they also get the same copyright as every other creation. Otherwise, people just could copy all NFTs and mint them again to earn money.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>FAQ<\/strong><\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Does Having an NFT Mean?<\/strong><\/h2>\n\n\n\n<p>If you have an NFT, then it means that you own it as the only person with access to its original data.&nbsp;<\/p>\n\n\n\n<p>This NFT will be a unique and non-fungible asset which gives it its value.&nbsp;<\/p>\n\n\n\n<p>The token is stored in the blockchain and only you have the access information for it. Because these NFTs are unique, they get value. The amount of value is dependent on how desired your NFT is.&nbsp;<\/p>\n\n\n\n<p>If it is a part of a popular collection, then its value can be extremely high. By owning an NFT, you can prove ownership for distinct assets, not only images but also music or even real estate.&nbsp;<\/p>\n\n\n\n<p>It further allows you to get exclusive access to products or services related to them. As the technology evolves, more applications will be developed. This way, we will eventually get more benefits.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Can the Metaverse Provide?<\/strong><\/h2>\n\n\n\n<p>A metaverse is a virtual world made with computer technology.&nbsp;<\/p>\n\n\n\n<p>The most known concept of it is already known as video games.&nbsp;<\/p>\n\n\n\n<p>But compared to the metaverse, they only represent a virtual world to play a game. A metaverse differs from a video game because it provides a virtual reality where people can interact with each other in a copy of the real world with original assets.&nbsp;<\/p>\n\n\n\n<p>It also combines computer animation with the advantages of the blockchain. The major use case is to use a cryptocurrency to allow buying things in the metaverse.&nbsp;<\/p>\n\n\n\n<p>This opens many possibilities to allow people to possess goods or collectibles in the virtual world with real ownership. This way people could buy land or real estate in this world and be the rightful owner of it.&nbsp;<\/p>\n\n\n\n<p>They could trade these goods exactly as in the real world. Businesses could rent virtual offices and have video meetings in it. This could open new opportunities for businesses and people to engage and work with each other, not possible in the real world.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Much Does the Average NFT Costs?<\/strong><\/h2>\n\n\n\n<p>It is not possible to tell the average cost of NFTs, but you can get many NFTs already for $20 &#8211; $100.&nbsp;<\/p>\n\n\n\n<p>The reason for this is that they can be worth any amount of money from nothing to millions of dollars.&nbsp;<\/p>\n\n\n\n<p>The value they provide heavily depends on factors such as the artist itself, the quality of the NFT and the demand for it. One of the most-known NFTs “Everyday’s: The First 5,000 Days” sold for more than $69 million.&nbsp;<\/p>\n\n\n\n<p>As with real art, there are nearly no limits and hype is the major factor to determine the price. NFTs that aren’t popular can even be sold for just a few bucks. This can be an excellent opportunity to start in the NFT space without investing too much.&nbsp;<\/p>\n\n\n\n<p>What you always should do is to inform yourself thoroughly before you make any purchase in the crypto space.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Much is the Cheapest Monkey NFT?<\/strong><\/h2>\n\n\n\n<p>If you want to go for a Bored Ape, the cheapest one to buy will cost you currently 76 ETH, which amounts to about $130,000 (Feb. 2023).&nbsp;<\/p>\n\n\n\n<p>If you want to go for any monkey NFT, then you could check out alternative collections like awmonks which start at about $35.&nbsp;<\/p>\n\n\n\n<p>Another alternative could be apeinvaders starting at $50. There will be many more alternatives with a variety of prices. These cheaper NFTs can also increase dramatically in prices if the value of Ethereum or the used cryptocurrency explodes.&nbsp;<\/p>\n\n\n\n<p>Maybe these cheaper NFTs could skyrocket or be a flop, losing their value. Choosing a good NFT can be a bit of gambling. There is always a bit of luck needed to get a cheap NFT, which then rises in demand.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion: What is an NFT Monkey?<\/h2>\n\n\n\n<p>The Bored Ape Yacht Club (BAYC) and its NFT collection of Bored Apes have become a significant phenomenon in the world of NFTs. These unique digital assets have gained immense popularity and value, thanks to their art style, limited availability, and association with prominent individuals and celebrities. <\/p>\n\n\n\n<p>The BAYC NFTs have become a status symbol, serving as a showcase of success and providing owners with exclusive perks within the Bored Ape community. The use of the Ethereum blockchain has enabled the seamless trading and ownership of these NFTs, further enhancing their value.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Crypto starters often ask what an NFT monkey is. It’s famous NFT art called Bored Ape Yacht Club comprising 10,000 avatar NFTs on Ethereum.<\/p>\n","protected":false},"author":5,"featured_media":1452,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[114],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/621"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=621"}],"version-history":[{"count":10,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/621\/revisions"}],"predecessor-version":[{"id":5847,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/621\/revisions\/5847"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1452"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}