{"id":648,"date":"2023-03-01T08:53:29","date_gmt":"2023-03-01T07:53:29","guid":{"rendered":"https:\/\/securenest.org\/?p=648"},"modified":"2024-01-24T23:34:54","modified_gmt":"2024-01-24T22:34:54","slug":"what-is-bitcoin-ordinal","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/what-is-bitcoin-ordinal","title":{"rendered":"What is a Bitcoin Ordinal? [Bitcoin NFTS]"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/what-is-bitcoin-ordinal.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"A light bulb containing a cryptocurrency symbolizing the concept of Bitcoin.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/what-is-bitcoin-ordinal.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/what-is-bitcoin-ordinal-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/what-is-bitcoin-ordinal-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/what-is-bitcoin-ordinal-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>The Ordinals Protocol allows for the inscription of data to every single satoshi of Bitcoin, creating a new type of digital asset called Ordinals<\/li>\n\n\n\n<li>Unlike NFTs on other blockchains, Ordinals are inscribed &#8220;on-chain,&#8221; meaning that all data is stored directly on the Bitcoin blockchain without relying on off-chain file storage systems<\/li>\n\n\n\n<li>Ordinals can be created and traded by using specific Ordinal wallets or by leveraging full nodes like Bitcoin Core<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Are Bitcoin Ordinals?<\/strong><\/h2>\n\n\n\n<p>With the new Ordinals Protocol, we can now inscribe data to every single satoshi, which creates a new type of digital asset called Ordinals.&nbsp;<\/p>\n\n\n\n<p>This data can include smart contracts, as in Ethereum, allowing to create the same applications as Non-Fungible Tokens or NFTs.&nbsp;<\/p>\n\n\n\n<p>Each <a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">Bitcoin<\/a> can be divided into 100,000,000 sats allowing to include the same number of Ordinals into every Bitcoin. Until now, only transactions are possible to send and receive value. <\/p>\n\n\n\n<p>Now we can apply the same applications to Bitcoin as in Ethereum with the help of smart contracts. The idea was proposed in 2022 by Casey Rodarmor, but goes <a href=\"https:\/\/bitcointalk.org\/index.php?topic=117224.0\" target=\"_blank\" rel=\"noreferrer noopener\">back to 2012.<\/a>&nbsp;<\/p>\n\n\n\n<p>It is described as “coloring” bitcoins by giving satoshis individual identities to allow them to be <a href=\"https:\/\/docs.ordinals.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">traded with “meaning”<\/a>. There is no additional sidechain required, and it can be used without changes to the Bitcoin network.&nbsp;<\/p>\n\n\n\n<p>The term “ordinals” comes from mathematics. It is used to describe a <a href=\"https:\/\/en.wikipedia.org\/wiki\/Ordinal_number\" target=\"_blank\" rel=\"noreferrer noopener\">linearly ordered set of numbers<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Are Ordinals Different From NFTS?<\/strong><\/h2>\n\n\n\n<p>Even if the application is the same as with NFTs, there is a major difference between NFTs and Ordinals.&nbsp;<\/p>\n\n\n\n<p>Ordinals are inscribed “on-chain” compared to NFTs. <\/p>\n\n\n\n<p>Until now, NFTs on Ethereum or Ethereum Virtual Machine (EVM) often save the actual NFT content on off-chain file storage systems. It works like a hard drive.&nbsp;<\/p>\n\n\n\n<p>This can even allow that the data on this hard drive can be updated, meaning the image file can change. This has happened often, as NFT projects update the image files to improve image quality.&nbsp;<\/p>\n\n\n\n<p>The owner of the NFTs then gets their original image file changed by a replaced higher detailed image file. This could be argued as “incomplete NFTs”, as the image files themselves are just stored on cloud drives and not on the blockchain itself.&nbsp;<\/p>\n\n\n\n<p>This led to the idea of using a system which stores all data onto the blockchain. Theoretically, if the cloud storage malfunctions and there are no backups, then the owner of an NFT could not access the actual image he possesses.&nbsp;<\/p>\n\n\n\n<p>The proof of ownership is stored separately from the image file on the blockchain itself, but not having the image would make this proof obsolete. Why need the proof of something that is not available anymore? With Ordinals, this problem is solved.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Does the Ordinal Theory Work?<\/strong><\/h2>\n\n\n\n<p>Ordinals work as a numbering scheme for satoshis.&nbsp;<\/p>\n\n\n\n<p>This allows to track individual satoshis, which is mandatory to track also the inscribed data.&nbsp;<\/p>\n\n\n\n<p>The Bitcoin protocol currently does not track the movement of satoshis. But satoshis are numbered in the order in which they’re mined and transferred from transaction inputs to transaction outputs. Both rely on order.&nbsp;<\/p>\n\n\n\n<p>The Ordinal theory does therefore not require another token, a sidechain or any other changes to the Bitcoin Protocol, because all necessary data is already there.&nbsp;<\/p>\n\n\n\n<p>With these ordered numbers we can now attach digital assets like NFTs or other types of tokens and track them between users. Satoshis can even be divided into categories based on their rarity, as not every satoshi is as rare as another one.&nbsp;<\/p>\n\n\n\n<p>This happens because of different factors a <a href=\"https:\/\/securenest.org\/learn\/origins-and-history-bitcoin\" data-type=\"post\" data-id=\"2694\" target=\"_blank\" rel=\"noopener\">satoshi<\/a> is created in. The Ordinal theory proposes some rarity levels:<\/p>\n\n\n\n<ol>\n<li><strong>Common:<\/strong> Any satoshi that is not the first in its block<\/li>\n\n\n\n<li><strong>Uncommon:<\/strong> The first satoshi in a block<\/li>\n\n\n\n<li><strong>Rare:<\/strong> The first one after each difficulty adjustment<\/li>\n\n\n\n<li><strong>Epic:<\/strong> The first sat after a halving<\/li>\n\n\n\n<li><strong>Legendary:<\/strong> The first one of every cycle (halving and difficulty adjustment coincide)<\/li>\n<\/ol>\n\n\n\n<p>The rarest satoshi is the first one ever created in the genesis block. The reason for the classification is to attach a kind of notation system to classify them. Because their distinct differences to NFTs Ordinals are compared to digital artifacts.&nbsp;<\/p>\n\n\n\n<p>NFTs point to off-chain data, which makes them “incomplete”. They further cannot be sold without paying the royalty to the creator, which is not permission-less.&nbsp;<\/p>\n\n\n\n<p>Digital artifacts have also to be immutable, but NFTs can get upgrade keys to alter their original data. This does not make them immutable to altering.<\/p>\n\n\n\n<p>Ordinals can be seen not as equal to NFTs, but as another digital asset with another purpose compared to NFTs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is an Ordinal Inscription?<\/strong><\/h2>\n\n\n\n<p>Inscriptions make an Ordinal from a satoshi.<\/p>\n\n\n\n<p>Inscriptions are any kind of content that is inscribed to those satoshis creating digital artifacts, which can also be described as NFTs.&nbsp;<\/p>\n\n\n\n<p>Compared to actual NFTs known from Ethereum’s blockchain, Ordinals do not require a separate place outside of the blockchain to store their data. These inscriptions can therefore be transferred in the same way as regular Bitcoin transactions.&nbsp;<\/p>\n\n\n\n<p>The difference is that the transferred satoshis now can contain additional data besides their pure value they hold. The content is held in the same principle as it is currently used by the web. This allows the inscription to be returned by a web server.&nbsp;<\/p>\n\n\n\n<p>Since introducing SegWit and Taproot, an environment has been created in which Ordinals are relatively economical. SegWit introduced a higher block size up to 4MB prior to 1MB per block, which was controversial but a pleasant benefit for Ordinals.&nbsp;<\/p>\n\n\n\n<p>Taproot finally <a href=\"https:\/\/insights.glassnode.com\/ordinal-theory-and-the-rise-of-inscriptions\/\" target=\"_blank\" rel=\"noopener\">removed some of the restrictions the SegWit had<\/a>, especially the limit on witness data which actually can contain additional data compared to the actual transaction data. This opened the way for Ordinals finally.&nbsp;<\/p>\n\n\n\n<p>Inscriptions are data which can be inserted into the witness data portion of a transaction.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Are People Using Ordinals For?<\/strong><\/h2>\n\n\n\n<p>Ordinals are already used for unique assets like images, audio, video, or text.&nbsp;<\/p>\n\n\n\n<p>Similar to NFTs, images are also the most popular use case.&nbsp;<\/p>\n\n\n\n<p>One reason for that could be that many hype Ordinals as the new NFTs which offer what NFTs should have done, saving all data on the blockchain instead of only the information for the proof-of-ownership.&nbsp;<\/p>\n\n\n\n<p>There are already collections of images created similar to NFT collections. If we include the fact that this entire topic started in late 2022 and got traction in 2023, then it can show the potential Ordinals will have from this year on.&nbsp;<\/p>\n\n\n\n<p>One factor showing how huge Ordinals might get is the change in Bitcoin’s blockchain size. On Dec 1st, 2022, the blockchain had a size of approx. 440GB.&nbsp;<\/p>\n\n\n\n<p>On Mar 1st, 2023 the blockchain had a size of 460GB, which means an increase of 20GB or about 4.5% in just 3 months. The blockchain size needed 14 years to get to 440GB in December, which equals an increase of about 7% per year.&nbsp;<\/p>\n\n\n\n<p>If this new concept is adopted, this could lead to a quickly increasing blockchain size in the near future.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Create and Trade Ordinals?<\/strong><\/h2>\n\n\n\n<p>Because this is a brand new topic, there are currently no marketplaces where you could trade Ordinals.&nbsp;<\/p>\n\n\n\n<p>The only way is to use an Ordinal wallet which specifically supports Ordinals and trade them peer-to-peer.&nbsp;<\/p>\n\n\n\n<p>The selection of wallets is limited because the adaption just begins. An alternative can be to set up your own wallet, which requires deep knowledge of programming and blockchain technology.&nbsp;<\/p>\n\n\n\n<p>You can also use your full node like Bitcoin Core to mint Ordinal NFTs (or a Bitcoin NFT) and inscribe them to satoshis. This is also a technical solution requiring knowledge.&nbsp;<\/p>\n\n\n\n<p>The convenient solution would be to use services that are already available to inscribe Ordinals for you. No matter what you choose, this market is new. Most people don’t have the knowledge of how to interact in this new environment.&nbsp;<\/p>\n\n\n\n<p>It will take time for adaptation and more services will be built from it. For now, it is relatively risky, requiring absolute caution. But as with crypto, the early adopters might get an excellent opportunity.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Will Be Next for Ordinals and the Blockchain?<\/strong><\/h2>\n\n\n\n<p>The next step for Ordinals will be the adoption process from early adaptors to the mass adaptation by Bitcoin users.&nbsp;<\/p>\n\n\n\n<p>This will open a new market where many marketplaces, platforms and services will expand or rise to open up this market for them.&nbsp;<\/p>\n\n\n\n<p>The potential could be huge, giving the Bitcoin network a counterpart to Ethereum&#8217;s NFTs and the success NFTs had back in 2021.&nbsp;<\/p>\n\n\n\n<p>Compared to NFTs, Ordinals could gain a lot of traction because of their distinct advantage in storing all their data on the blockchain. The blockchain will remain as it is without additional sidechains or similar solutions.&nbsp;<\/p>\n\n\n\n<p>This could not only bring Bitcoin into a new market with a lot of potential, but could also potentially hurt Ethereum in the long-run. Another factor will be blockchain size. As the beginning of 2023 showed, it&#8217;s increasing faster than ever.&nbsp;<\/p>\n\n\n\n<p>If this trend continues, time will tell if there could be potential issues associated with that, especially if now all Bitcoin blocks will get filled to their full capacity. This also <a href=\"https:\/\/www.bitcoininsider.org\/article\/205532\/impact-ordinals-bitcoin-mempools-transaction-size\" target=\"_blank\" rel=\"noreferrer noopener\">could lead to mempool congestion<\/a> and potentially more pressure on transaction fees.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>FAQ<\/strong><\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Is Bitcoin Just a Number?<\/strong><\/h2>\n\n\n\n<p>Yes, Bitcoin is just a stored string of alphanumeric characters as every other digital data.&nbsp;<\/p>\n\n\n\n<p>It does not exist in physical form.&nbsp;<\/p>\n\n\n\n<p>Bitcoin transactions are verified by a network of computers that use cryptography and blockchain technology to ensure secure and accurate transfers.&nbsp;<\/p>\n\n\n\n<p>The value of each individual Bitcoin is determined by the market &#8211; it fluctuates based on the supply and demand of the tokens in circulation. One Bitcoin can be thought of as simply a number representing its worth.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Many Decimal Places Does Bitcoin Have?<\/strong><\/h2>\n\n\n\n<p>Bitcoin can store 8 decimal places of value.&nbsp;<\/p>\n\n\n\n<p>This allows users to have more precise control over their transactions and their spending power.&nbsp;<\/p>\n\n\n\n<p>Unlike fiat currencies that are often denominated in whole numbers or fractions of a dollar, Bitcoin can be divided into as small as 0.00000001 BTC &#8211; commonly referred to as one satoshi.&nbsp;<\/p>\n\n\n\n<p>This level of precision allows users to make extremely accurate payments, which is one reason why it is so popular with online traders and merchants.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Makes up 1 Bitcoin?<\/strong><\/h2>\n\n\n\n<p>A single Bitcoin comprises 100 million satoshis.&nbsp;<\/p>\n\n\n\n<p>It further consists of two main components. The first component is the public ledger, known as the blockchain.&nbsp;<\/p>\n\n\n\n<p>This is a distributed ledger that keeps track of all the transactions ever made on the Bitcoin network and ensures that these transactions are verified and secure.&nbsp;<\/p>\n\n\n\n<p>The second component is a digital asset, known as Bitcoin tokens, which can be sent from one person to another over the internet. When someone sends or receives Bitcoins, they are actually sending or receiving fractions of these tokens.&nbsp;<\/p>\n\n\n\n<p>Each token has its own unique code and contains a set amount of value in units called Satoshis (1 Satoshi = 0.00000001 BTC). In other words, 1 Bitcoin can be divided into 100 million Satoshis and each Satoshi represents a tiny fraction of a Bitcoin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion<\/strong>: What is a Bitcoin Ordinal?<\/h2>\n\n\n\n<p>The Ordinal protocol has opened the potential for Bitcoin users to use NFTs on the Bitcoin blockchain.&nbsp;<\/p>\n\n\n\n<p>By inscribing data on satoshis, users can create digital assets as Ordinals with unique identities that are immutable and permissionless.&nbsp;<\/p>\n\n\n\n<p>What sets Ordinals apart from existing NFTs is their ability to save all data on-chain without relying on cloud storage systems.&nbsp;<\/p>\n\n\n\n<p>Though still in its infancy, the Ordinal protocol has immense potential as a major innovation in both Bitcoin’s network and the larger cryptocurrency industry, provided it can gain further adoption by early adopters, developers, and platforms.&nbsp;<\/p>\n\n\n\n<p>The effects of Ordinals will be far-reaching, so blockchain developers, researchers, and users alike should keep an eye out for recent developments in this growing field.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bitcoin Ordinals are digital data inscribed on bitcoins lowest unit, satoshis. The Ordinal protocol now allows the creation of Bitcoin NFTs like in Ethereum.<\/p>\n","protected":false},"author":5,"featured_media":1370,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[94],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/648"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=648"}],"version-history":[{"count":13,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/648\/revisions"}],"predecessor-version":[{"id":2890,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/648\/revisions\/2890"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1370"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}