{"id":661,"date":"2023-03-05T20:11:31","date_gmt":"2023-03-05T19:11:31","guid":{"rendered":"https:\/\/securenest.org\/?p=661"},"modified":"2024-01-24T23:34:54","modified_gmt":"2024-01-24T22:34:54","slug":"bitcoin-address-compressed-uncompressed","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/bitcoin-address-compressed-uncompressed","title":{"rendered":"How to Know if a Bitcoin Address is Compressed or Uncompressed?"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/bitcoin-address-compressed-uncompressed.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"An illustration of a Bitcoin on a yellow background, showcasing its address compression.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/bitcoin-address-compressed-uncompressed.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/bitcoin-address-compressed-uncompressed-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/bitcoin-address-compressed-uncompressed-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/bitcoin-address-compressed-uncompressed-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>Bitcoin addresses can be compressed or uncompressed, depending on the type of public key they are derived from<\/li>\n\n\n\n<li>Compressed Bitcoin addresses are smaller and more efficient for transactions<\/li>\n\n\n\n<li>To identify the compression type of a Bitcoin address, you need to analyze the prefix of the encoded public key<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Know if a Bitcoin Address is Compressed or Uncompressed?<\/strong><\/h2>\n\n\n\n<p>A <a href=\"https:\/\/securenest.org\/learn\/what-are-bitcoin-addresses\" data-type=\"post\" data-id=\"2733\" target=\"_blank\" rel=\"noopener\">Bitcoin address is always derived<\/a> from a public key, which is derived from a private key. <\/p>\n\n\n\n<p>In this process, the private key gives two outputs for the public key, a compressed and an uncompressed version.<\/p>\n\n\n\n<p>A public key is a mathematical value on an elliptic curve, while a private key is a randomly generated 256-bit number. The public key always comes with a pair of integers, the x and y value, both 32 bytes long.&nbsp;<\/p>\n\n\n\n<p>This value describes a certain point on the elliptic curve used by the ECDSA algorithm. An Uncompressed public key comes with both values concatenated and pre-pended with the prefix ‘0x04’. This key is 65 bytes long.&nbsp;<\/p>\n\n\n\n<p>The compressed version takes the x-value only and pre-pends either a ‘0x02’ or ‘0x03’ to the <a href=\"https:\/\/developer.bitcoin.org\/glossary.html\" target=\"_blank\" rel=\"noreferrer noopener\">value, resulting in a size of 33 bytes<\/a>. When a Bitcoin address is generated, it derives from the public key using a SHA256 hash algorithm.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/securenest.org\/learn\/what-is-bech32-format\" target=\"_blank\" rel=\"noopener\">It then encodes the result with Bech32<\/a> or Base58 encoding into a final address format, which doesn’t have any specific prefix depending on the compression used before. The final address always starts with a ‘1’, ‘3’ or ‘bc1’, no matter the compression.<\/p>\n\n\n\n<p>Compressed addresses are smaller than uncompressed addresses. The ‘0x02’ prefix shows that the y-coordinate of the public key is even, while the ‘0x03’ prefix shows that the y-coordinate is odd.&nbsp;<\/p>\n\n\n\n<p>It is important to note that a compressed and uncompressed public key is just derived from the private key. The private key really matters, as it is used to sign transactions and <a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">prove ownership of Bitcoin<\/a>. <\/p>\n\n\n\n<p>Both versions point to the same private key, so they both act as the same location used to transfer bitcoin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The Difference Between Compressed and Uncompressed Addresses<\/strong><\/h2>\n\n\n\n<p>If we look at the Bitcoin addresses we use with prefixes like ‘1’, ‘3’ or ‘bc1’, we won’t see if they are compressed or uncompressed.&nbsp;<\/p>\n\n\n\n<p>We have to look at the addresses of the public keys from which the final wallet address derives.&nbsp;<\/p>\n\n\n\n<p>These keys are formatted distinctly, allowing us to differentiate between the type of compression used. When a public key is compressed, its hex string starts with either ‘0x02’ or ‘0x03’.<\/p>\n\n\n\n<p>These two prefixes show that the public key is compressed, comprising the ECDSA x-coordinate only. If a public key is uncompressed, its hex string starts with ‘0x04’.&nbsp;<\/p>\n\n\n\n<p>This prefix shows that the public key is uncompressed, and it comprises both integer coordinates x and y of the public key. This means that the uncompressed public key contains more information, as it includes both the x and y coordinates.&nbsp;<\/p>\n\n\n\n<p>This amounts to 64 bytes for both values plus 1 byte for the prefix, resulting in 65 bytes. The compressed version has only half the amount of 32 bytes, plus also 1 byte for their prefix, summed to 33 bytes.<\/p>\n\n\n\n<p>The compression of public keys is used to reduce the size of transactions and improve their efficiency. Compressed public keys take up less space in the blockchain, which reduces transaction fees and speeds up the transaction process.<\/p>\n\n\n\n<p>However, it is important to note that not all Bitcoin wallets and clients support compressed public keys. A wallet has to support compressed keys in order to use them.&nbsp;<\/p>\n\n\n\n<p>Today, wallets typically use the compressed version, so this question should only arise if you set up everything by yourself running a full node. It is important to keep your private key secure, as it is used to generate your public key and the address.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Use for Compressed and Uncompressed Wallet Addresses?<\/strong><\/h2>\n\n\n\n<p>For using compressed and uncompressed wallet addresses, there are some factors to pay attention to that can help ensure the security of your transactions.<\/p>\n\n\n\n<p>First, it is important to understand the differences between the two types of addresses.&nbsp;<\/p>\n\n\n\n<p>Compressed addresses are smaller and more efficient for transactions, while uncompressed addresses are more widely supported by wallets and Bitcoin clients.&nbsp;<\/p>\n\n\n\n<p>We derive compressed addresses from a compressed public key, which is 33 bytes long, while we derive uncompressed addresses from an <a href=\"https:\/\/people.duke.edu\/~charvey\/Teaching\/697_2022\/Public_Presentations_697\/DeFi_Primitives_Module_4.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">uncompressed public key, which is 65 bytes long<\/a> and starts with “0x04” in hexadecimal format.<\/p>\n\n\n\n<p>Regardless of the type of address you choose, it is important to use a cryptographic random number generator to generate a private key. This helps ensure attackers can not easily guess the private key.&nbsp;<\/p>\n\n\n\n<p>The private key is then used to compute the corresponding public key, which is used in Bitcoin transactions. When sending Bitcoin, it is important to use the correct type of compressed address for the recipient.&nbsp;<\/p>\n\n\n\n<p>Changing the compression afterwards could lead to potential loss of bitcoins stored there. It is important to keep your private key secure and not share it with anyone. Public addresses can be freely shared, as they do not reveal any sensitive information.<\/p>\n\n\n\n<p>It is also important to note that each private key corresponds to a unique wallet address, and that different private keys will generate unique addresses.&nbsp;<\/p>\n\n\n\n<p>If you have imported a private key or generated a new one, be sure to use the correct corresponding public address when sending Bitcoin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Are Bitcoin Addresses Encoded?<\/strong><\/h2>\n\n\n\n<p>The Bech32 encoding scheme encodes Bitcoin addresses.&nbsp;<\/p>\n\n\n\n<p>This applies to the newer addresses (SegWit and Taproot) as the legacy formats were encoded in Base58.&nbsp;<\/p>\n\n\n\n<p>The Base58 encoding scheme uses lower- and uppercase letters and an additional <a href=\"https:\/\/en.bitcoin.it\/wiki\/Technical_background_of_version_1_Bitcoin_addresses#How_to_create_Bitcoin_Address\" target=\"_blank\" rel=\"noreferrer noopener\">4-byte checksum<\/a> with the Base58Check. P2PKH addresses were pre-pended with an ‘1’ and P2SH addresses were pre-pended with an ‘3’.&nbsp;<\/p>\n\n\n\n<p>The newer addresses use the Bech32 encoding without case lettering and an additional error checking for further security, making it less prone to typing errors.&nbsp;<\/p>\n\n\n\n<p>Base58 is like Base64 encoding, but it excludes certain characters that can be easily mistaken for one another, such as 0 and O or l and I.&nbsp;<\/p>\n\n\n\n<p>Base58 is commonly used for addresses and private keys because it is more compact and easier to read than other encoding schemes. Bech32 is a newer encoding scheme used for encoding Bitcoin wallet addresses.&nbsp;<\/p>\n\n\n\n<p>It is a native SegWit address format and more efficient than the previous Base58 format. Bech32 addresses start with “bc1” and use a unique set of characters compared to Base58.&nbsp;<\/p>\n\n\n\n<p>Bech32 addresses also include error detection, so it is easier to detect and correct errors in the address. Overall, the crucial difference between Base58 and Bech32 is their efficiency and error detection capabilities.&nbsp;<\/p>\n\n\n\n<p>Finally, Bech32 addresses are more easily readable and less prone to errors than Base58 addresses, which can be important for ease of use and security.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>FAQ<\/strong><\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a Compressed Bitcoin Address?<\/strong><\/h2>\n\n\n\n<p>A compressed Bitcoin wallet address is the public key that has been compressed in order to save space and make it more efficient to work with.&nbsp;<\/p>\n\n\n\n<p>Compressed public keys are shorter than regular ones, which makes them easier to store and use.&nbsp;<\/p>\n\n\n\n<p>The major advantage of a compressed Bitcoin public key is that it allows users to save money on transaction costs by using smaller amounts of data when sending or receiving payments.&nbsp;<\/p>\n\n\n\n<p>Also uncompressed addresses are always supported, which makes them more compatible. Since most software now also uses the compressed version, this advantage is not a deciding factor anymore.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Do I Convert a Compressed BTC Public Key to Uncompressed?<\/strong><\/h2>\n\n\n\n<p>It is possible to convert a compressed BTC public key to an uncompressed one, using specific tools or converting it manually.<\/p>\n\n\n\n<p>To convert a compressed public key to an uncompressed one, you need to <a href=\"https:\/\/www.math.uci.edu\/~asilverb\/bibliography\/compress.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">perform a point multiplication with the generator point<\/a> of the elliptic curve. This requires some deeper knowledge so most people would rather use an online tool for converting.<\/p>\n\n\n\n<p>However, there is no need to convert a compressed public key to an uncompressed one, as we can interchange both types of keys in most cases.&nbsp;<\/p>\n\n\n\n<p>Some older Bitcoin software may not support compressed public keys, but modern wallets and software can handle both compressed and uncompressed keys without issue.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Are the Two Types of Bitcoin Addresses?<\/strong><\/h2>\n\n\n\n<p>You can divide the Bitcoin wallet address either in the SegWit and Legacy formats or you can divide their corresponding public keys into compressed or uncompressed ones.&nbsp;<\/p>\n\n\n\n<p>Depending on how you ask, there are multiple categorizations possible.&nbsp;<\/p>\n\n\n\n<p>SegWit and Legacy formats provide distinct features. The older Legacy formats have case sensitivity and fewer features, making them less efficient and more costly. SegWit formats support advanced features such as multisig and lower fees.&nbsp;<\/p>\n\n\n\n<p>In terms of public keys, the compressed or the uncompressed ones <a href=\"https:\/\/cs.stanford.edu\/people\/eroberts\/courses\/soco\/projects\/public-key-cryptography\/history.html\" target=\"_blank\" rel=\"noopener\">derive from the same private key<\/a> but differ in size. Compressed ones are 33 bytes and uncompressed ones are 65 bytes. This makes the compressed version smaller and therefore cheaper to transfer.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a Compressed vs. Uncompressed Public Key?<\/strong><\/h2>\n\n\n\n<p>Two public keys always derive from the same private key, a compressed and an uncompressed one.&nbsp;<\/p>\n\n\n\n<p>An Uncompressed public key includes both values concatenated and pre-pended with the prefix ‘0x04’.&nbsp;<\/p>\n\n\n\n<p>These keys are 65 bytes long. Their compressed counterpart always comes with just one value pre-pended either a ‘0x02’ or ‘0x03’ to the value, resulting in a size of 33 bytes.&nbsp;<\/p>\n\n\n\n<p>Their major difference is that the compression of public keys is used to reduce their size. They take up less space in the blockchain, which reduces their fees and allows for faster transaction processes because of their smaller size.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion<\/strong>: <strong>Bitcoin Address is Compressed vs. Uncompressed<\/strong><\/h2>\n\n\n\n<p>Bitcoin public addresses can be compressed or uncompressed, and knowing the difference between the two is important for using Bitcoin securely.&nbsp;<\/p>\n\n\n\n<p>Compressed addresses are smaller and more efficient for transactions, while uncompressed addresses are more widely supported by wallets and Bitcoin clients.&nbsp;<\/p>\n\n\n\n<p>To identify whether a Bitcoin wallet address is compressed or uncompressed, you need to analyze the prefix of the encoded public key.&nbsp;<\/p>\n\n\n\n<p>An uncompressed public key comes with the prefix ‘0x04’ while the compressed version is pre-pended either with a ‘0x02’ or ‘0x03’.&nbsp;<\/p>\n\n\n\n<p>While most crypto wallets and clients support both types of addresses, some may only support one type, but this will most likely be the case if you set up your own wallet. Today’s wallets support both formats.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>To know if a Bitcoin address is compressed or uncompressed can be helpful. The private key specifies if a BTC address is compressed and uncompressed.<\/p>\n","protected":false},"author":4,"featured_media":1365,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[92],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/661"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=661"}],"version-history":[{"count":12,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/661\/revisions"}],"predecessor-version":[{"id":4224,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/661\/revisions\/4224"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1365"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=661"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=661"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=661"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}