{"id":703,"date":"2023-03-19T20:41:31","date_gmt":"2023-03-19T19:41:31","guid":{"rendered":"https:\/\/securenest.org\/?p=703"},"modified":"2024-01-24T23:34:53","modified_gmt":"2024-01-24T22:34:53","slug":"12-vs-24-word-seed-phrase","status":"publish","type":"post","link":"https:\/\/securenest.org\/learn\/12-vs-24-word-seed-phrase","title":{"rendered":"12-Word vs 24-Word Seed Phrase"},"content":{"rendered":"<figure class=\"wp-block-post-featured-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1344\" height=\"896\" src=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/12-vs-24-word-seed-phrase.webp\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"An illustration of a wallet with a bitcoin and a 24-Word Seed Phrase.\" style=\"object-fit:cover;\" srcset=\"https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/12-vs-24-word-seed-phrase.webp 1344w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/12-vs-24-word-seed-phrase-300x200.webp 300w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/12-vs-24-word-seed-phrase-1024x683.webp 1024w, https:\/\/securenest.org\/wp-content\/uploads\/2023\/03\/12-vs-24-word-seed-phrase-768x512.webp 768w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/figure>\n\n\n<p><strong>Key Takeaways:<\/strong><\/p>\n\n\n\n<ul>\n<li>A seed phrase, also known as a recovery phrase or secret recovery phrase, is a set of random words<\/li>\n\n\n\n<li>A 12-word seed phrase provides 128 bits of entropy, while a 24-word seed phrase provides 256 bits of entropy<\/li>\n\n\n\n<li>Storing your seed phrase securely is crucial as anyone who gains access to it can steal the funds within your wallet<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>12-Word Seed Phrase vs 24-Word Seed Phrase?<\/strong><\/h2>\n\n\n\n<p>When creating a cryptocurrency wallet, users are often given the option to choose between a 12-word seed phrase and a 24-word seed phrase, which is an <a href=\"https:\/\/securenest.org\/learn\/is-bitcoin-encrypted\" data-type=\"post\" data-id=\"305\" target=\"_blank\" rel=\"noopener\">important cryptographic element in Bitcoin<\/a>. <\/p>\n\n\n\n<p>While both phrases serve the same purpose of generating the private key necessary to access your cryptocurrency wallet, the difference lies in the level of security they provide.&nbsp;<\/p>\n\n\n\n<p>A 12-word seed phrase contains 128 bits of entropy, which is the measure of the amount of uncertainty or randomness in the data used to generate the phrase.&nbsp;<\/p>\n\n\n\n<p>This is because each word in the BIP39 mnemonic phrase represents 11 bits of entropy, resulting in 132 bits for a 12-word phrase. The overall entropy comprises the 128 bits entropy plus 4 bits for the checksum.&nbsp;<\/p>\n\n\n\n<p>However, the BIP39 seed phrase only uses 2,048 words, which limits the possible combinations that can be generated. A 24-word seed phrase contains 256 bits of entropy since each word represents 11 bits, resulting in 264 bits.&nbsp;<\/p>\n\n\n\n<p>The same logic applies with 256 bits of entropy plus 8 bits for the checksum. While a 12-word phrase is easier to remember and type, it is also easier to guess or brute force by attackers.&nbsp;<\/p>\n\n\n\n<p>With only 128 bits of entropy, it would take significantly less time and resources to guess your seed phrase than a 24-word phrase with 256 bits of entropy. But even if it is easier to guess, it is also nearly impossible to brute force.&nbsp;<\/p>\n\n\n\n<p>12 words are 2^128 combinations, so it’s nearly impossible to get the right combination.&nbsp;<\/p>\n\n\n\n<p>It’s important to understand that the actual security of a 12-word <a href=\"https:\/\/www.cs.utexas.edu\/users\/moore\/acl2\/manuals\/current\/manual\/index-seo.php\/BITCOIN____BIP39-MNEMONIC-TO-SEED?path=3769\/37877\/2372\/5485\/10325\" target=\"_blank\" rel=\"noreferrer noopener\">BIP39 mnemonic phrase<\/a> (or 24-word) depends on the security of the software or hardware wallet that uses it.&nbsp;<\/p>\n\n\n\n<p>If an attacker gains access to your wallet, they might guess your seed phrase and steal your cryptocurrency. Therefore, it’s crucial to store your seed phrase within a secure hardware wallet and never store it online.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a Wallet Recovery Phrase?<\/strong><\/h2>\n\n\n\n<p>A wallet recovery phrase, also known as a seed phrase or secret recovery phrase, is a set of random words that are used to recover access to a cryptocurrency wallet.&nbsp;<\/p>\n\n\n\n<p>This phrase is generated when a new wallet is created, and it is important to store it safely because it is the only way to access the funds in the wallet.&nbsp;<\/p>\n\n\n\n<p>A recovery phrase typically contains 12 or 24 random words, and the number of words can affect the level of security. The phrase allows users to recover their wallet in case of lost or stolen devices or forgotten passwords.&nbsp;<\/p>\n\n\n\n<p>Anyone with access to the recovery phrase can gain access to the wallet and steal the funds, so it’s important to keep it safe and never share it with anyone. The words in a seed phrase are randomly generated, and the likelihood of guessing a seed phrase is extremely low.&nbsp;<\/p>\n\n\n\n<p>The phrase provides a backup to the public key and private key, which are used to generate the wallet address and sign transactions, respectively.&nbsp;<\/p>\n\n\n\n<p>Overall, a wallet recovery phrase is an essential component of any cryptocurrency wallet, and users should always store it in a secure location and avoid storing it online or in plain sight.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How Does Generating a Seed Phrase with BIP39 Words List Works?<\/strong><\/h2>\n\n\n\n<p>BIP39 is a specification that outlines a method for generating a cryptographic seed phrase that can recover a crypto wallet in case it’s lost, stolen, or damaged.&nbsp;<\/p>\n\n\n\n<p>The process begins by generating a random sequence of bits known as entropy, which serves as the basis for the seed phrase.&nbsp;<\/p>\n\n\n\n<p>This entropy is then passed through a hash function, which produces a checksum that is appended to the entropy to create a new sequence of bits. These bits are then split into groups of 11 bits, each of which is mapped to a word from a list of 2,048 words.&nbsp;<\/p>\n\n\n\n<p>The resulting list of words makes up the seed phrase, which is typically either 12 or 24 words long.&nbsp;<\/p>\n\n\n\n<p>The length of the seed phrase determines the amount of entropy that it can hold, with 12 words providing 128 bits of entropy and 24 words providing <a href=\"https:\/\/www.law.cornell.edu\/regulations\/wyoming\/021-19-Wyo-Code-R-SS-19-9\" target=\"_blank\" rel=\"noreferrer noopener\">256 bits of entropy<\/a>.&nbsp;<\/p>\n\n\n\n<p>Once the seed phrase is generated, it can recover the wallet, as it contains all the information needed to recreate the private keys that are necessary to access your wallet.&nbsp;<\/p>\n\n\n\n<p>It’s important to note that the seed phrase should be stored securely, as anyone who gains access to it might steal the funds within the wallet.&nbsp;<\/p>\n\n\n\n<p>A wallet that allows seed recovery, such as a hardware wallet, can store the seed phrase safely and provide an additional layer of security.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Could Someone Guess My Seed Phrase?<\/strong><\/h2>\n\n\n\n<p>It is highly unlikely that someone could guess your seed phrase.&nbsp;<\/p>\n\n\n\n<p>A typical seed phrase is a combination of 12 to 24 random words chosen from a list of 2,048 words, which generates 2^128 combinations for 12 words only.&nbsp;<\/p>\n\n\n\n<p>This makes it practically impossible for someone to guess the phrase by randomly trying different combinations. The chances of someone guessing a 12-word seed phrase are roughly one in 2,048^12. This number is so large that it is difficult to comprehend.&nbsp;<\/p>\n\n\n\n<p>24-word seed phrases have a chance of 1 in 2,048^24 to be correct. This will practically never be possible to guess. However, if your seed phrase is compromised, someone might gain access to your <a href=\"https:\/\/securenest.org\/learn\/what-is-bitcoin\" data-type=\"post\" data-id=\"30\" target=\"_blank\" rel=\"noopener\">bitcoin<\/a> wallet or other cryptocurrency wallet. <\/p>\n\n\n\n<p>For example, if a software wallet that allows for the seed phrase to be generated online generates your seed phrase, your phrase could be intercepted or stolen.&nbsp;<\/p>\n\n\n\n<p>To ensure the recovery phrase is safe, it is recommended to create a new wallet offline and generate the seed phrase on an offline device.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Keep Your Seed Phrase Safe from Hacking?<\/strong><\/h2>\n\n\n\n<p>Keeping your <a href=\"https:\/\/repository.stcloudstate.edu\/cgi\/viewcontent.cgi?article=1154&amp;context=msia_etds\" target=\"_blank\" rel=\"noreferrer noopener\">seed phrase safe from hacking<\/a> is crucial to protecting your cryptocurrency assets. Here are some tips to help you secure your seed phrase:<\/p>\n\n\n\n<ol>\n<li><strong>Store your seed phrase offline: <\/strong><strong><br><\/strong>One of the best ways to protect your seed phrase from hacking is to store it offline. Write it down on a piece of paper and keep it in a secure location, like a safe or safe deposit box. Even better is to engrave it in metal.<\/li>\n\n\n\n<li><strong>Avoid using digital devices:<\/strong><br>Avoid storing your seed phrase on digital devices like your computer or smartphone. If your device is hacked, your seed phrase could be compromised.<\/li>\n\n\n\n<li><strong>Don’t share your seed phrase:<\/strong><a href=\"https:\/\/www.cyber.nj.gov\/alerts-advisories\/scams-attempt-to-steal-seed-phrases-to-access-crypto-wallets\" target=\"_blank\" rel=\"noreferrer noopener\"><br>Never share your seed phrase<\/a> with anyone. If someone gains access to your seed phrase, they can access your cryptocurrency wallet.<\/li>\n\n\n\n<li><strong>Use a passphrase: <\/strong><strong><br><\/strong>Consider using a passphrase besides your seed phrase. This can add an extra layer of security to your wallet.<\/li>\n\n\n\n<li><strong>Keep multiple copies:<\/strong><br>Keep multiple copies of your seed phrase in different locations. If one copy is lost or damaged, you can still recover your wallet with another copy. Use different materials and ways to store it to have maximum protection.<\/li>\n\n\n\n<li><strong>Use a hardware wallet:<\/strong><br>Consider using a hardware wallet that stores your data offline. This can be a more secure option than a software wallet.<\/li>\n\n\n\n<li><strong>Be cautious with online services:<\/strong><br>If you must use an online service to store your seed phrase, choose a reputable provider and enable two-factor authentication for added security. Even better is to never use online services to store seed phrases.<br><\/li>\n<\/ol>\n\n\n\n<p>By following these tips, you can help keep your seed phrase secure and protect your cryptocurrency assets from hacking.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Happens If You Lose a Seed Phrase?<\/strong><\/h2>\n\n\n\n<p>Losing your seed phrase can have dire consequences for your Bitcoin wallet.&nbsp;<\/p>\n\n\n\n<p>If you lose your seed phrase, you <a href=\"https:\/\/researchblog.duke.edu\/2022\/03\/21\/duke-first-year-founds-cryptocurrency-security-startup-harpie\/\" target=\"_blank\" rel=\"noreferrer noopener\">cannot recover your wallet<\/a>.&nbsp;<\/p>\n\n\n\n<p>What you should keep in mind is that you still can access your crypto without a seed phrase. Often, you set up a password for your wallet. This password is used to unlock the wallet to make transactions.&nbsp;<\/p>\n\n\n\n<p>The seed phrase is used in such a case only if you want to recover the wallet. The password is then your information needed to access the funds in your wallet. You should also take the same measures to secure the password.&nbsp;<\/p>\n\n\n\n<p>Since a seed phrase is the only way to recover your wallet, losing it means that you will no longer have control over your Bitcoin. There is no way to recover a lost seed phrase, and there is no way to recover the wallet without it.&nbsp;<\/p>\n\n\n\n<p>In short, if you lose your seed phrase, you lose your Bitcoin. But only if you also lose your wallet or the password for it. As long as you can access your wallet, you won’t need to recover it. Here, the seed phrase is not needed.&nbsp;<\/p>\n\n\n\n<p>What is also important is that if someone gets your seed phrase, they can recover your wallet from it. It is crucial to keep your seed phrase secure, as losing it can lead to permanent loss or access to your Bitcoin holdings.&nbsp;<\/p>\n\n\n\n<p>It is also important to ensure that your seed phrase is not accessible to anyone else, as anyone who gains access to it can also gain access to your wallet and your Bitcoin.&nbsp;<\/p>\n\n\n\n<p>If you suspect that your seed phrase has been compromised, create a new wallet and transfer your funds to it immediately. You should also note that a seed phrase is your last resort for backup purposes.&nbsp;<\/p>\n\n\n\n<p>If you don’t lose your wallet, then you won’t need the seed phrase to access your funds. You will need your wallet password.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">FAQ<\/h2>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Should Bitcoin Seed Be 12 or 24 words?<\/strong><\/h2>\n\n\n\n<p>Both 12-word and 24-word seed phrases are commonly used to secure Bitcoin wallets.&nbsp;<\/p>\n\n\n\n<p>A 12-word seed phrase is often considered sufficient, as it provides a high level of security while also being easy to remember.&nbsp;<\/p>\n\n\n\n<p>However, a 24-word seed phrase offers an even greater level of security, as it contains more combinations of words and is more difficult to guess or brute-force.&nbsp;<\/p>\n\n\n\n<p>Ultimately, the decision to use a 12-word or 24-word seed phrase comes down to preference and the level of security desired by the user. 12 words are nearly impossible to guess in the right order, so it is enough.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Is 12-Word Seed Phrase Secure Enough?<\/strong><\/h2>\n\n\n\n<p>A 12-word seed phrase provides 128 bits of entropy, which is secure enough for most people.&nbsp;<\/p>\n\n\n\n<p>However, a longer phrase, such as a 24-word seed phrase, provides even more security, as it has 256 bits of entropy.&nbsp;<\/p>\n\n\n\n<p>A seed phrase is used to recover your wallet and should be kept safe from prying eyes. While a 12-word seed phrase is secure enough, some people opt for the extra security provided by a 24-word seed phrase.&nbsp;<\/p>\n\n\n\n<p>Ultimately, the choice between a 12-word and 24-word seed phrase depends on preference, but 12 words are already impossible to guess or brute-force, so it should be enough.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is an Example of a 24 Words Recovery Phrase?<\/strong><\/h2>\n\n\n\n<p>An example of a 12-word recovery seed could be: “off gather strike tell floor income science lounge bleak sunset shell hedgehog”.&nbsp;<\/p>\n\n\n\n<p>This is just one example, as recovery phrases are generated randomly by wallet software.&nbsp;<\/p>\n\n\n\n<p>It is important to keep the recovery phrase secure and not share it with anyone, as it grants full access to the wallet and its contents. It is recommended to store multiple copies of the recovery phrase in secure locations, such as a safe deposit box or a fireproof safe.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion<\/strong>: <strong>12-Word Vs 24-Word Seed Phrase<\/strong><\/h2>\n\n\n\n<p>A seed phrase is a crucial element for protecting your cryptocurrency wallet, and it is essential to keep it secure at all times.&nbsp;<\/p>\n\n\n\n<p>It is recommended that you generate your seed phrase offline and write it down on paper, ensuring that it is kept in a secure location.&nbsp;<\/p>\n\n\n\n<p>Often, your wallet provider will generate a random seed phrase for you. You should never share your seed phrase with anyone and avoid storing it online or on your computer.&nbsp;<\/p>\n\n\n\n<p>Losing your seed phrase could cause losing access to your cryptocurrency wallet and your digital assets. Therefore, it is critical to take the precautions to protect your seed phrase and keep it safe from potential theft or loss.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your crypto wallet needs a recovery phrase. They can be secured with a 12-word seed or 24-word seed phrase, but which is better?<\/p>\n","protected":false},"author":4,"featured_media":1342,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[1],"tags":[96],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/703"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/comments?post=703"}],"version-history":[{"count":12,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/703\/revisions"}],"predecessor-version":[{"id":3325,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/posts\/703\/revisions\/3325"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media\/1342"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=703"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=703"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=703"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}