{"id":1001,"date":"2023-05-18T21:44:15","date_gmt":"2023-05-18T19:44:15","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1001"},"modified":"2023-05-20T21:40:13","modified_gmt":"2023-05-20T19:40:13","slug":"power-supply-unit-psu","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/power-supply-unit-psu","title":{"rendered":"Power Supply Unit (PSU)"},"content":{"rendered":"\n<p>A Power Supply Unit (PSU) is an important component of the crypto mining setup. A functioning PSU is needed to provide the electrical power required by the miner hardware to process the mathematical calculations that create the cryptocurrency. Without a reliable power supply, the miner can&#8217;t process and coins cannot be mined.<\/p>\n\n\n\n<p>A PSU serves as the link between the wall socket and all of the components inside the miner. It is important to choose a compatible PSU with enough wattage and amperage to support all of the components being used. The wattage needed depends on the components being used and will vary from miner to miner, but usually the PSU required is at least between 1200-1400 Watts.<\/p>\n\n\n\n<p>Additionally, the PSU should be able to operate in a consistently hot environment. The miner may also need a fan or heatsink to provide extra cooling in order to keep it running efficiently, as hot temperatures can cause a loss in mining performance. Finally, it is important to consider whether a PSU is 80 Plus certified.<\/p>\n\n\n\n<p>This means that it meets efficiency standards set by the 80 Plus organization and is relatively efficient when it comes to converting power from the wall socket into usable power for your machine.<\/p>\n\n\n\n<p>Generally speaking, these tend to be more expensive, but can end up being more cost-effective in the long run as they require fewer watts to perform the same job as an uncertified unit, which means you can maximize profit by using fewer resources.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1001"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1001"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1001"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1001"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1001"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}