{"id":1005,"date":"2023-05-18T21:45:15","date_gmt":"2023-05-18T19:45:15","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1005"},"modified":"2023-05-20T21:39:07","modified_gmt":"2023-05-20T19:39:07","slug":"proof-of-history-poh","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/proof-of-history-poh","title":{"rendered":"Proof-of-History (PoH)"},"content":{"rendered":"\n<p>Proof-of-History (PoH) is a novel consensus mechanism introduced by Solana, a high-performance blockchain platform. At its core, PoH is a time-keeping mechanism that creates a historical record of events in a blockchain network. It establishes a timestamp for each transaction or event by leveraging a cryptographic hash function, which creates a unique output based on the input data.<\/p>\n\n\n\n<p>This hash-based timestamping allows PoH to create a deterministic and verifiable record of events in the blockchain. The process of PoH involves a designated entity, known as the &#8220;historian,&#8221; which is responsible for generating timestamps for the events.<\/p>\n\n\n\n<p>The historian is selected through a PoS-like mechanism, where token holders in the Solana network can stake their tokens to participate in the selection process. Once selected, the historian generates timestamps for all the events in the network, including transactions, smart contract executions, and other events, creating a chronological order of events.<\/p>\n\n\n\n<p>The PoH timestamps are then used to establish the order of transactions in Solana&#8217;s block production process. Solana uses a PoS-based mechanism called Tower BFT (Byzantine Fault Tolerance) to achieve consensus on the order of blocks. The PoH timestamps provide a reference point for the validators to agree on the order of transactions in the blocks, which helps prevent double spending and other malicious activities.<\/p>\n\n\n\n<p>One of the key benefits of PoH is its scalability. By using a deterministic and verifiable time-keeping mechanism, Solana can achieve high transaction throughput without relying on computationally expensive PoW algorithms. PoH also enhances security by leveraging the distributed nature of PoS-based selection of historians, which makes it difficult for a single entity to manipulate the timestamping process.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1005"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1005"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1005"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1005"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1005"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}