{"id":1009,"date":"2023-05-18T21:46:14","date_gmt":"2023-05-18T19:46:14","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1009"},"modified":"2023-05-20T21:40:46","modified_gmt":"2023-05-20T19:40:46","slug":"prune-mode-pruning","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/prune-mode-pruning","title":{"rendered":"Prune Mode (Pruning)"},"content":{"rendered":"\n<p>Prune mode is a feature in Bitcoin Core that allows users to reduce their disk usage by removing blocks from the local copy of the blockchain (“pruned”). When pruned, only the most recent blocks are kept, and all of the older blocks are discarded.&nbsp;<\/p>\n\n\n\n<p>This effectively reduces the amount of disk space needed to store a full copy of the Bitcoin blockchain. When a user activates prune mode, the Bitcoin Core software will delete all blocks that are older than a certain height. The user can specify the height up to which blocks should be kept on disk.&nbsp;<\/p>\n\n\n\n<p>For example, if the user has specified a pruning height of 500 blocks, Bitcoin Core will keep only the last 500 blocks and discard all previous blocks. This reduces the disk space needed to store the blockchain significantly, while still allowing the user to participate in the Bitcoin network.<\/p>\n\n\n\n<p>Prune mode allows users to reduce the amount of disk space occupied by the Bitcoin blockchain, while still allowing them to participate in the Bitcoin network. This is beneficial for users who want to participate in the Bitcoin network, but don’t have enough free disk space to store a full copy of the blockchain.&nbsp;<\/p>\n\n\n\n<p>This solution is suitable if users want to use Bitcoin Core as a wallet without storing all the data. What should be noted is that because such a node doesn’t store the entire data, it won&#8217;t have all the abilities of an actual full node. No entire copy of the ledger doesn’t add security to the blockchain and doesn’t support it from this standing point.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1009"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1009"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1009"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1009"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1009"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}