{"id":1013,"date":"2023-05-18T21:47:09","date_gmt":"2023-05-18T19:47:09","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1013"},"modified":"2023-05-20T21:42:36","modified_gmt":"2023-05-20T19:42:36","slug":"public-ledger","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/public-ledger","title":{"rendered":"Public Ledger"},"content":{"rendered":"\n<p>A public ledger is a digital record-keeping system used to verify and store the details of transactions, usually financial transactions. It records details such as who sent the money and who received it, when the transaction took place, and the amount involved. Public ledgers are vital for verifying transactions and helping to prevent fraud.<\/p>\n\n\n\n<p>Public ledgers are part of the blockchain technology underlying cryptocurrencies. Blockchain is a distributed database that allows each computer connected to the network to have a copy of all of the transactions that have been made. This means they can all be cross-checked with each other, providing an extra layer of security.<\/p>\n\n\n\n<p>Transactions are added to the ledger in blocks or batches, which are secured by cryptographic processes and linked together chronologically. Public ledgers are secure because all the computers in the network can be used to verify information and prevent double-spending.<\/p>\n\n\n\n<p>This is done by using a consensus protocol, which determines which version of the ledger should be accepted. When a transaction is initiated, it is broadcast to all the computers in the network, who then must agree that the transaction is valid. Once it has been validated, it is added to the public ledger as a new block.<\/p>\n\n\n\n<p>Overall, public ledgers are an essential part of a blockchain-based system, allowing for secure and transparent record-keeping of digital transactions. They help to prevent fraud and provide confidence in the security of transactions, enabling trust between all participants.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1013"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1013"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1013"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1013"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1013"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}