{"id":1014,"date":"2023-05-18T21:47:41","date_gmt":"2023-05-18T19:47:41","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1014"},"modified":"2023-05-20T21:43:56","modified_gmt":"2023-05-20T19:43:56","slug":"public-key-cryptography","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/public-key-cryptography","title":{"rendered":"Public-Key Cryptography"},"content":{"rendered":"\n<p>Public-Key cryptography is a type of cryptography that uses two keys – one public and one private. These keys are mathematically linked but are different, allowing them to securely encrypt and decrypt data. The public key can be shared freely, whereas the private key should be kept strictly confidential.<\/p>\n\n\n\n<p>Public-Key cryptography involves two algorithms: a key encipherment algorithm and a key decipherment algorithm. The key encipherment algorithm is used to encrypt or encode data so that it cannot be read by anyone other than the intended recipient who holds the corresponding private key.<\/p>\n\n\n\n<p>This type of encryption is called asymmetric encryption because the two keys used in the process are different. The key decipherment algorithm is used to decrypt or decode data that has been encrypted with the corresponding public key. Asymmetric encryption is particularly useful for ensuring privacy when sending sensitive information over the Internet because it uses two separate keys to lock and unlock the information without requiring any secret knowledge.<\/p>\n\n\n\n<p>Public-Key cryptography is also used in digital signatures, which are used to authenticate the identity of the sender of digitally signed messages. To create a digital signature, the sender of the message uses their own private key to sign a hash of the message.<\/p>\n\n\n\n<p>The recipient can then use the sender’s public key to verify that the message has not been tampered with during transit.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1014"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1014"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1014"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1014"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1014"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}