{"id":1026,"date":"2023-05-18T21:51:30","date_gmt":"2023-05-18T19:51:30","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1026"},"modified":"2023-05-20T21:46:00","modified_gmt":"2023-05-20T19:46:00","slug":"royalties","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/royalties","title":{"rendered":"Royalties"},"content":{"rendered":"\n<p>Royalties in Non-Fungible Tokens (NFTs) refer to a form of passive payment given to the creator of an asset whenever that asset is bought, sold or used. Such payments, generally paid in cryptocurrency, are typically aimed at incentivizing the owner or creator of the underlying asset.<\/p>\n\n\n\n<p>NFTs can be used to represent everything from digital collectibles to art, music, software and even real-world property rights. The idea behind royalties is that it both rewards the creator of the asset and encourages them to keep creating similar content in order to earn more income.<\/p>\n\n\n\n<p>The amount of royalties earned by an NFT may depend on a variety of factors, including the type of asset being represented, the number of times it is sold or traded, and the overall popularity of the asset. Generally, the more popular and widely traded an asset is, the more royalties its creator can expect to receive.<\/p>\n\n\n\n<p>NFTs can also be used to generate recurring royalty payments for creators, for example through smart contracts that automatically distribute royalties according to predetermined metrics. Royalties from NFTs are often seen as a way of rewarding creators for their work while providing an incentive for them to continue creating.<\/p>\n\n\n\n<p>Royalties also benefit purchasers of the underlying asset, as they can be used to reimburse them for any costs associated with purchasing and reselling the asset. This provides an additional incentive for people to invest in NFTs and help build a vibrant digital economy.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[43],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1026"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1026"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1026"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1026"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1026"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}