{"id":1032,"date":"2023-05-18T21:53:05","date_gmt":"2023-05-18T19:53:05","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1032"},"modified":"2023-05-20T21:46:10","modified_gmt":"2023-05-20T19:46:10","slug":"scam","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/scam","title":{"rendered":"Scam"},"content":{"rendered":"\n<p>Scam is a form of fraud involving deception into, often monetary gain. It’s conducted via email or phone, and targets unsuspecting individuals who lack sufficient expertise or knowledge to realize they’re about to be scammed. It involves convincing victims to part with personal details such as credit card numbers and account information, shell out money for bogus services, invest in fraudulent schemes, or hand over cash in the name of a prize.<\/p>\n\n\n\n<p>Scams typically start with an email or phone call from someone posing as a legitimate firm, institution, or charity. The scammer then uses a variety of tactics to manipulate the victim into believing that their request is genuine and beneficial. Tactics such as high pressure sales pitches and promises of huge rewards for “ investing” have all been used by scammers in the past to persuade victims.<\/p>\n\n\n\n<p>Scammers may even claim to be part of a well-known company&#8217;s customer service team, or as legal professionals. They may also use official-looking documents, logos and signatures to emphasize their authenticity and authority. The consequences of falling victim to a scam can be serious, both financially and emotionally.&nbsp;<\/p>\n\n\n\n<p>Victims may be left crippled with debt or required to disclose sensitive financial information that can be used to steal identities, commit additional frauds, or conduct cyberattacks. That is why it is important to be alert when receiving unexpected communications and always double check any requests before responding.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[44],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1032"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1032"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1032"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1032"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1032"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}