{"id":1046,"date":"2023-05-18T21:56:48","date_gmt":"2023-05-18T19:56:48","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1046"},"modified":"2023-05-20T21:53:36","modified_gmt":"2023-05-20T19:53:36","slug":"txid-transaction-id","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/txid-transaction-id","title":{"rendered":"TXID (Transaction ID)"},"content":{"rendered":"\n<p>A transaction ID (TXID) is a unique identifier that is assigned to each transaction on the Bitcoin blockchain. The TXID is generated using a cryptographic hash function that converts the transaction data into a 256-bit hash value. This hash value is unique for each transaction and can be used to identify and track the transaction on the blockchain.<\/p>\n\n\n\n<p>Each transaction on the Bitcoin network has a TXID that is included in the block header of the block that confirms the transaction. When a new transaction is created, it is broadcast to the Bitcoin network and is included in a block by a miner. The TXID of the transaction is included in the block header, which serves as Proof-of-Work for the block.<\/p>\n\n\n\n<p>TXIDs are important because they allow nodes on the network to verify that a transaction has been included in a block and has been accepted by the network. When a node receives a new block from the network, it can check the TXIDs of the transactions against the list of unspent transaction outputs (UTXOs) in its local copy of the blockchain to verify that the transactions are valid and that the block is valid.<\/p>\n\n\n\n<p>By using TXIDs to verify the validity of transactions and blocks, the Bitcoin network ensures the integrity and security of its blockchain. Transactions cannot be altered or deleted once they are confirmed and added to the blockchain, making the network resistant to fraud and tampering.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[45],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1046"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1046"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}