{"id":1076,"date":"2023-05-18T22:04:42","date_gmt":"2023-05-18T20:04:42","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1076"},"modified":"2023-05-20T21:55:22","modified_gmt":"2023-05-20T19:55:22","slug":"zero-confirmation-transaction","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/zero-confirmation-transaction","title":{"rendered":"Zero-Confirmation-Transaction"},"content":{"rendered":"\n<p>A zero-confirmation transaction describes a transaction on a blockchain or any form of public ledger that has not yet been confirmed by the consensus protocol. In essence, it is a transaction that is in the process of being verified and is not yet included in a block on the blockchain.<\/p>\n\n\n\n<p>Typically, when a user sends a zero-conf transaction to the network, they include a fee which in turn incentivizes miners to add the transaction to the block it is in, thus making it confirmable. A zero confirmation transaction is usually made when there is a high degree of trust between two parties and they want to quickly transfer funds to one another.<\/p>\n\n\n\n<p>The transaction gets broadcasted to the network and is picked up by nodes, but not yet included in the blockchain. Until the transaction is included in the blockchain, it will remain unconfirmed. This can take from just a few minutes to, in some cases, days depending on the transaction size and traffic on the network.<\/p>\n\n\n\n<p>The concept of a zero-confirmation transaction involves tradeoffs between time, trust, and security. These transactions are riskier than ones that are included in the blockchain, since an attacker could mount a double spending attack and invalidate the transaction.<\/p>\n\n\n\n<p>Therefore, these types of transactions should only be used if both parties trust each other. On the other hand, these transactions are very fast and can be used for near-instant payments.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[51],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1076"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1076"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1076"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1076"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1076"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}