{"id":1082,"date":"2023-05-18T22:19:37","date_gmt":"2023-05-18T20:19:37","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=1082"},"modified":"2023-05-20T13:57:59","modified_gmt":"2023-05-20T11:57:59","slug":"51-attack","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/51-attack","title":{"rendered":"51%-Attack"},"content":{"rendered":"\n<p>A 51% attack is an attack on a blockchain network where an attacker gains control of more than 50% of the network&#8217;s computing power or hash rate. This allows them to prevent new transactions from being confirmed, double-spend coins, and stop other miners from being rewarded.<\/p>\n\n\n\n<p>The purpose of a 51% attack is to gain control of the blockchain and perform malicious activities that would not be possible with a smaller proportion of the network&#8217;s computing power. This could include double-spending coins, changing the record of past transactions, or preventing other users from completing valid transactions.<\/p>\n\n\n\n<p>The threat of a 51% attack is one of the main challenges for blockchain networks. As decentralized networks rely on consensus for security and trust, if an attacker controls more than 50% of the network’s hashrate, they can effectively manipulate the network and disrupt its security and functionality.<\/p>\n\n\n\n<p>A 51% attack usually requires an attacker to acquire a large amount of computing power and resources to overpower the network. As mining new coins can be very expensive, an attacker’s goal is usually to double-spend coins that have already been spent, preventing them from reaching their intended recipient.<\/p>\n\n\n\n<p>Fortunately, due to the distributed nature of most blockchain protocols, it is extremely difficult to perform a 51% attack. As the computing power of the network grows, it becomes increasingly expensive to acquire enough hashrate to overpower the network.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[25],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/1082"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=1082"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=1082"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=1082"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=1082"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}