{"id":337,"date":"2023-05-12T19:40:21","date_gmt":"2023-05-12T17:40:21","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=337"},"modified":"2023-06-06T23:51:36","modified_gmt":"2023-06-06T21:51:36","slug":"bitcoin","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/bitcoin","title":{"rendered":"Bitcoin"},"content":{"rendered":"\n<p>Bitcoin is a digital currency that operates without centralized authorities such as the government, financial institutions or banks. It was invented in 2008 by an anonymous person or group known as Satoshi Nakamoto and was released in 2009. Bitcoin uses a public ledger system known as the blockchain to record transactions, which are stored in blocks chained together and secured by complex cryptographic information.<\/p>\n\n\n\n<p>Bitcoin has a limited supply of 21 million bitcoins. Every 4 years, the Bitcoin rewards are halved, decreasing the inflation rate constantly. This makes a difference to traditional currencies where supply and inflation increase. Compared to traditional currencies, bitcoins are not tied to physical assets such as gold.<\/p>\n\n\n\n<p>It works within its own blockchain-based economic system instead. Transactions are confirmed and added to the public ledger through a process called “mining”. The integrity of the blockchain is maintained by these miners who secure it with their machine which provides computational power.<br>Bitcoin has become more popular in recent years because of its anonymity, low transactions and decentralization. This makes it attractive to people who want to remain anonymous and transfer funds with low fees in a short time without traditional financial systems.<\/p>\n\n\n\n<p>However, bitcoin is also subject to a high volatility which lets prices fluctuate drastically. This causes concerns for most people if it can be a legitimate alternative to our traditional currencies.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[27],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/337"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=337"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=337"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=337"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=337"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}