{"id":854,"date":"2023-05-18T14:07:39","date_gmt":"2023-05-18T12:07:39","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=854"},"modified":"2023-05-20T13:59:11","modified_gmt":"2023-05-20T11:59:11","slug":"address","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/address","title":{"rendered":"Address"},"content":{"rendered":"\n<p>A wallet address is a string of alphanumeric characters that represents a destination on the blockchain network. This address is where cryptocurrency can be sent to and from and simply serves as an identifier for a particular user in the blockchain network.&nbsp;<\/p>\n\n\n\n<p>All cryptocurrency wallets come with a wallet address, which can be shared publicly on webpages or other digital platforms. Generally, these wallet addresses are 34-62 characters long, with both uppercase and lowercase letters and numbers. The wallet address is created using a cryptographic hashing algorithm known as Secure Hash Algorithm 256 (SHA-256).&nbsp;<\/p>\n\n\n\n<p>This algorithm creates a unique code that is used to identify an individual user in the network. When cryptocurrency is sent to another user&#8217;s wallet address, it creates a transaction, which is stored on the public ledger. The transaction data will contain user information, amount of currency sent and the date and time of transfer – all of which are part of the blockchain network’s immutable record of transactions (or the “blockchain”).&nbsp;<\/p>\n\n\n\n<p>This means that, while users can send cryptocurrency to anyone with a wallet address, they cannot access the sender’s personal information or funds at any point in the process. The transaction will show up on the blockchain network’s public ledger as a completed transfer between two wallet addresses.&nbsp;<\/p>\n\n\n\n<p>This data is then verified by miners, who add the transaction to a newly formed block of other transactions and cryptographically hash it into the blockchain.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[26],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/854"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=854"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=854"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=854"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=854"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}