{"id":857,"date":"2023-05-18T14:10:27","date_gmt":"2023-05-18T12:10:27","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=857"},"modified":"2023-05-20T14:06:40","modified_gmt":"2023-05-20T12:06:40","slug":"cryptography","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/cryptography","title":{"rendered":"Cryptography"},"content":{"rendered":"\n<p>Cryptography is the practice of taking plaintext and encoding it into a secret form of data, known as ciphertext. The process of encryption and decryption (which is the method of taking a ciphertext and returning it to plaintext form) uses a special code or key to complete the process.&nbsp;<\/p>\n\n\n\n<p>Part of cryptography is making sure only those who have been granted access to the message can decode it. Cryptography has been used for centuries to protect communication between two or more parties, by making sure only those with the key can decipher the contents of the message.&nbsp;<\/p>\n\n\n\n<p>As technology has evolved, so too has cryptography, and now it is used for digital security in many different ways.Cryptography is commonly used to secure communication between two endpoints, such as encrypting email between two users or encrypting a web session from a user&#8217;s computer to the website they are visiting.&nbsp;<\/p>\n\n\n\n<p>Additionally, it is used to secure data stored remotely, such as databases, credit card information, and cloud storage. Cryptographic algorithms are further used to securely sign documents and code.Cryptocurrencies use it in the form of Public-Key Cryptography with the use of public and private keys to allow independent transactions for their users.&nbsp;<\/p>\n\n\n\n<p>This way it can be transferred without the need or the trust of third parties, the system creates the trust by itself. Every participant can share their address to receive crypto and don’t need to be afraid of stealing any funds.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[28],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/857"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=857"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=857"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=857"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}