{"id":882,"date":"2023-05-18T20:51:47","date_gmt":"2023-05-18T18:51:47","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=882"},"modified":"2023-05-20T14:02:57","modified_gmt":"2023-05-20T12:02:57","slug":"bitcoin-core","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/bitcoin-core","title":{"rendered":"Bitcoin Core"},"content":{"rendered":"\n<p>Bitcoin Core is a full node implementation of the Bitcoin protocol. It is written in the programming language C++, and serves as an open source software for node-based bitcoin transactions. At its core, Bitcoin Core serves as an interface between users’ wallets and the Bitcoin network.<\/p>\n\n\n\n<p>This allows for a seamless experience for users looking to send, receive, and store their digital currency. Bitcoin Core is a fully-featured node that holds the entire transaction history of Bitcoin from its genesis block back in 2009. It validates all Bitcoin transactions and blocks by downloading a full copy of the blockchain, which includes all the transactions that have ever happened on the Bitcoin network.<\/p>\n\n\n\n<p>Every new block that is added to the blockchain is checked against Bitcoin Core’s history, meaning only valid transactions that meet the consensus rules of the network can be included in a block. Additionally, Bitcoin Core is also able to serve as a mining node, allowing users to join the network and become miners by validating transactions and creating new blocks.<\/p>\n\n\n\n<p>Miners earn rewards for their work in the form of newly-minted Bitcoin, helping to maintain the security of the network and ensuring its decentralization. Overall, Bitcoin Core is an essential part of the Bitcoin infrastructure that connects users with the Bitcoin network and maintains its security by preventing double-spend attacks. Without Bitcoin Core, Bitcoin wouldn’t be able to function as a secure, globally-accessible digital currency.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[27],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/882"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=882"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=882"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=882"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=882"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}