{"id":884,"date":"2023-05-18T20:52:02","date_gmt":"2023-05-18T18:52:02","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=884"},"modified":"2023-05-20T14:02:57","modified_gmt":"2023-05-20T12:02:57","slug":"bitcoin-halving","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/bitcoin-halving","title":{"rendered":"Bitcoin Halving"},"content":{"rendered":"\n<p>The bitcoin halving is a process that occurs every 210,000 blocks and reduces the rewards miners receive for mining new bitcoins. This process is designed to control the supply of Bitcoin and keep it in line with its predetermined inflation rate. When the halving was first introduced in 2009, miners were rewarded with 50 bitcoins for each block they mined.<\/p>\n\n\n\n<p>As of May 11th 2020, the reward dropped to 6.25 BTC. The halving works in cycles; every 210,000 blocks mined, the reward miners receive is cut in half. As the number of mined blocks increases, the total amount of Bitcoin in circulation increases as well.<\/p>\n\n\n\n<p>This ensures that the number of new coins entering the market is limited and controlled, preventing drastic increases in inflation. The halving process also affects miners’ profitability; as the reward decreases, it becomes harder and more expensive for miners to make a profit.<\/p>\n\n\n\n<p>This can affect the number of miners operating on the network at any given time, thus affecting the overall hash rate of Bitcoin. A decrease in miners can potentially lead to slower transaction speeds, higher transaction fees and disruption of services provided by miners.<\/p>\n\n\n\n<p>The bitcoin halving is a crucial process for maintaining the supply of Bitcoin and maintaining its value. It limits inflation and affects miners’ profitability, all without disrupting the smooth functioning of the network. As such, all users of Bitcoin should be aware of what the halving is and how it works. The next halving will be in early 2024 and the reward will then drop to 3.125 BTC.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[27],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/884"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=884"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=884"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=884"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=884"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}