{"id":898,"date":"2023-05-18T21:00:25","date_gmt":"2023-05-18T19:00:25","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=898"},"modified":"2023-05-20T14:07:11","modified_gmt":"2023-05-20T12:07:11","slug":"child-pays-for-parent","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/child-pays-for-parent","title":{"rendered":"Child-Pays-for-Parent"},"content":{"rendered":"\n<p>Child-Pays-for-Parent (CPFP) is a transaction process that can eliminate the issue of unconfirmed transactions or “stuck” transactions. A common issue for users of digital currencies is the occurrence of unconfirmed transactions. This situation occurs when a user sends a transaction to the network but the transaction fee is not high enough for miners to process it quickly.<\/p>\n\n\n\n<p>The transaction can end up stuck in limbo for long periods of time, either partially or completely unconfirmed. CPFP helps to solve this issue by allowing a user to resend the transaction with an accompanying fee that pays for the stuck parent transaction at the same time.<\/p>\n\n\n\n<p>The parent transaction is related to the stuck one and will be processed alongside it when the fee is high enough. This method works due to the relationship between the transactions, and miners do not need to confirm each transaction separately. In simple terms, CPFP allows users to “bump” their stuck transactions by sending another transaction with a fee that pays both for the parent transaction and the child one.<\/p>\n\n\n\n<p>It is a great tool for users who have experienced issues with unconfirmed transactions as it can often save them time and money that would otherwise be lost due to fees associated with retrying transactions. CPFP also helps to increase network throughput, as it incentivizes miners to prioritize processing of transactions with larger fees. As a result, CPFP helps to ensure that transactions are processed quickly and reliably.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[28],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/898"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=898"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=898"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=898"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=898"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}