{"id":902,"date":"2023-05-18T21:01:53","date_gmt":"2023-05-18T19:01:53","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=902"},"modified":"2023-05-20T14:07:18","modified_gmt":"2023-05-20T12:07:18","slug":"confirmations","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/confirmations","title":{"rendered":"Confirmations"},"content":{"rendered":"\n<p>A confirmation is the process of ensuring that a blockchain transaction has been successfully processed by the network and is highly unlikely to be reversed. This means that a transaction is more secure, as it has been validated by multiple people and computers across the network.<\/p>\n\n\n\n<p>When someone sends an amount of cryptocurrency, the transaction needs to be validated by the network before it can be considered complete. This process is referred to as ‘confirmation’. To get a transaction confirmed, it must be processed by a number of computers dispersed throughout the network. These computers are called ‘nodes’.<\/p>\n\n\n\n<p>When a transaction is broadcasted across the network, it is picked up by one of the nodes that compose the blockchain. This node then combines it with another existing transaction, forming a ‘block’ which is cryptographically encoded and sent out to the other nodes on the network.<\/p>\n\n\n\n<p>Nodes then repeatedly send out these blocks and, once they have been accepted by more than half of all nodes on the network — a point at which consensus is achieved — the blocks are confirmed and added to the blockchain ledger. At this point, the transaction is considered final and irreversible, and can no longer be refused or reversed.&nbsp;<\/p>\n\n\n\n<p>The more confirmation blocks that are added on top of a transaction, the more secure it becomes and the less chance there is that it can be reversed or tampered with.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[28],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/902"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=902"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=902"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=902"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=902"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}