{"id":909,"date":"2023-05-18T21:08:05","date_gmt":"2023-05-18T19:08:05","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=909"},"modified":"2023-05-20T14:12:45","modified_gmt":"2023-05-20T12:12:45","slug":"dapps-decentralized-apps","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/dapps-decentralized-apps","title":{"rendered":"DApps (Decentralized Apps)"},"content":{"rendered":"\n<p>Decentralized apps, commonly referred to as dapps, are applications that are built on a decentralized network such as a blockchain or distributed ledger. Dapps are typically open source, meaning that their code is publicly available and anyone can audit, modify or even create their own versions of the application.<\/p>\n\n\n\n<p>Unlike traditional apps, dapps do not rely on a central authority such as a company or governmental institution. Instead, these applications run on a peer-to-peer network of computers maintained by volunteers across the globe, providing users with access to more secure and efficient services.<\/p>\n\n\n\n<p>Dapps are more energy efficient and secure than traditional apps, since they do not need to be centrally controlled or monitored. Additionally, since they are open-source, the codebase can be tweaked and improved by the community, making them more reliable and affordable over time.<\/p>\n\n\n\n<p>Additionally, since no central entity is in control of the application, there is no single point of failure, making these applications resilient in the event of system outages or cyber attacks. Finally, one of the primary advantages of dapps is that they allow users to interact with the application without trusting a third party.<\/p>\n\n\n\n<p>This allows for users to store their data privately and securely, and also makes it easier for users to access services without providing unnecessary personal information. This makes dapps an attractive option for those looking for privacy or anonymity when accessing online services.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[29],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/909"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=909"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=909"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=909"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=909"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}