{"id":911,"date":"2023-05-18T21:08:43","date_gmt":"2023-05-18T19:08:43","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=911"},"modified":"2023-05-20T14:11:46","modified_gmt":"2023-05-20T12:11:46","slug":"dai","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/dai","title":{"rendered":"Dai"},"content":{"rendered":"\n<p>DAI is a decentralized stablecoin that is pegged to the value of the US dollar. It is created and managed by MakerDAO, a decentralized autonomous organization built on the Ethereum blockchain. The purpose of DAI is to provide a stable and decentralized cryptocurrency that can be used for transactions and as a store of value, without being subject to the volatility that is often associated with other cryptocurrencies.<\/p>\n\n\n\n<p>The unique feature of DAI is that it is collateralized by other cryptocurrencies, such as Ethereum, which are locked up in a smart contract. This means that the value of the DAI is backed by the value of the collateral, ensuring that it remains stable even in times of market volatility.<\/p>\n\n\n\n<p>The collateral is also over-collateralized, meaning that there is more collateral than DAI in circulation, which provides an extra layer of security. MakerDAO has a system of governance in place that allows token holders to vote on decisions that affect the platform, such as changes to the collateral requirements or interest rates.<\/p>\n\n\n\n<p>This makes DAI a truly decentralized stablecoin, as it is not controlled by any central authority or government. One of the key benefits of DAI is its ability to be used in various decentralized finance (DeFi) applications. It can be used as collateral for loans, as a means of payment for goods and services, and as a stablecoin for trading on decentralized exchanges.<\/p>\n\n\n\n<p>DAI has gained popularity in the DeFi space due to its stability, decentralization, and versatility, and has become one of the most widely used stablecoins in the ecosystem.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[29],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/911"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=911"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=911"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=911"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=911"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}