{"id":918,"date":"2023-05-18T21:10:44","date_gmt":"2023-05-18T19:10:44","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=918"},"modified":"2023-05-20T21:11:09","modified_gmt":"2023-05-20T19:11:09","slug":"double-hashing","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/double-hashing","title":{"rendered":"Double-Hashing"},"content":{"rendered":"\n<p>Double-hashing is a type of hashing algorithm that combines two separate hash functions to produce a single result. It is used in computer science and cryptography as a hashing technique to ensure secure data storage and protection against malicious attacks.<\/p>\n\n\n\n<p>When double-hashing is used, the input is hashed twice&#8211;first with one hash function, then again with a second one. The combination of the two hashes produces the resultant value, which is fed back into the system to be used in whatever process it is needed for.<\/p>\n\n\n\n<p>This method of using two different hashes for better security is called double-hashing. Double-hashing can be used to store passwords or other sensitive bits of data securely. For example, if a user&#8217;s password is hashed with a single function, it can be cracked with ease using certain techniques.<\/p>\n\n\n\n<p>But when the same password is double-hashed, the complexity and difficulty of cracking it is much greater. Double-hashing is useful for data storage and logging, electronic signatures, as well as authentication. By double-hashing data and signing it with two different signatures, it becomes harder to forge, tamper with or otherwise access potentially malicious information.<\/p>\n\n\n\n<p>Double hashing also offers an additional layer of security against dictionary attacks, since an attacker must find not just one but two collisions in order to gain access to the data.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[29],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/918"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=918"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=918"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=918"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=918"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}