{"id":925,"date":"2023-05-18T21:12:39","date_gmt":"2023-05-18T19:12:39","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=925"},"modified":"2023-05-20T21:11:09","modified_gmt":"2023-05-20T19:11:09","slug":"encryption","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/encryption","title":{"rendered":"Encryption"},"content":{"rendered":"\n<p>Encryption is a process of transforming data using an algorithm and a shared key to make the data unreadable to anyone except the intended recipient. Encryption has been used for centuries to secure sensitive information, however, it was not until the 1970s that the public began to use encryption on computers.<\/p>\n\n\n\n<p>The purpose of encryption is to ensure that only authorized people can access the data and that the data cannot be intercepted and viewed by a third party. Encryption works by using a mathematical algorithm and a secret key known only to the sender and receiver.<\/p>\n\n\n\n<p>The sender applies the algorithm to their data and the secret key to generate an &#8220;encrypted&#8221; version. This encrypted version is sent over the network, and when the receiver receives it, they apply the same algorithm and key to decrypt it. The algorithm and the key are designed to be mathematically related in such a way that only matching combinations can decrypt the data.<\/p>\n\n\n\n<p>This means that anyone who intercepts the data will not be able to understand it as they will not have the correct algorithm and key combination. Encryption can be used for various different types of data, from files, emails and documents to information stored in databases or transmitted over networks.<\/p>\n\n\n\n<p>It is an essential part of computer security and helps protect user data from unauthorized access by scrambling it when it is sent over networks. It is also used by governments and businesses to ensure confidential data is kept secure and private.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[30],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/925"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=925"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=925"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=925"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=925"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}