{"id":956,"date":"2023-05-18T21:30:24","date_gmt":"2023-05-18T19:30:24","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=956"},"modified":"2023-05-20T21:26:42","modified_gmt":"2023-05-20T19:26:42","slug":"intrinsic-value","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/intrinsic-value","title":{"rendered":"Intrinsic Value"},"content":{"rendered":"\n<p>Intrinsic value is an important concept across multiple disciplines, from finance to moral philosophy. Intrinsic value refers to the inherent worth or value of something, apart from its monetary or exchange value. It is a measure of the usefulness or desirability of an object, service, or idea. In finance, it is used to help calculate the intrinsic or theoretical value of a stock, due to its revenue potential or other factors.<\/p>\n\n\n\n<p>In moral philosophy, intrinsic value is used to evaluate whether something is good or bad based on its own merits, rather than its external value (what other people think of it). For example, one might argue that a painting has intrinsic value because, although it may not be seen as an asset from a financial perspective, it still has beauty and significance that cannot be measured in monetary terms.<\/p>\n\n\n\n<p>In addition, some people view certain objects or qualities such as kindness, honesty, and freedom as having intrinsic value. This means that these qualities or objects can have worth and value even in the absence of any market forces or financial considerations.<\/p>\n\n\n\n<p>Each person has their own internal sense of what is valuable and they may choose to invest their time and energy into pursuing those values. Ultimately, intrinsic value is a measure of the worth or significance of something, divorced from any external influences.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[34],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/956"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=956"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}