{"id":963,"date":"2023-05-18T21:32:54","date_gmt":"2023-05-18T19:32:54","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=963"},"modified":"2023-05-20T21:28:50","modified_gmt":"2023-05-20T19:28:50","slug":"lightning-network","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/lightning-network","title":{"rendered":"Lightning Network"},"content":{"rendered":"\n<p>The lightning network is a second layer payment protocol, built on top of a blockchain, that enables users to make fast and secure payments with lower fees. It does this by utilizing a type of transaction known as off-chain transactions.<\/p>\n\n\n\n<p>These transactions occur in a micro-billed peer-to-peer network, where payments are processed between two parties without broadcast to the blockchain. This allows for faster confirmation times and reduced transaction fees. The lightning network is an important development in the cryptocurrency space, because it bridges the gap between high-speed payments and low-cost transactions.<\/p>\n\n\n\n<p>It utilizes a type of smart contract called a “Hashed Time Lock Contract” (HTLC). This contract is used to open a payment channel between two parties, in which both parties commit funds to a unique lightning address. This lightning address is used to send payments between parties in the channel and all transactions are recorded on the blockchain.<\/p>\n\n\n\n<p>Additionally, HTLCs can be used to exchange different types of assets over the lightning network. The lightning network also allows users to quickly and safely move funds between multiple parties. This enables payments that flow between multiple hop points, allowing users to make instantaneous transactions across multiple blockchain networks such as Bitcoin, Litecoin and Ethereum.<\/p>\n\n\n\n<p>Ultimately, this makes the lightning network an incredibly powerful tool for making low-cost payments between parties who are geographically distant.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[37],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/963"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=963"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=963"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=963"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=963"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}