{"id":967,"date":"2023-05-18T21:34:02","date_gmt":"2023-05-18T19:34:02","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=967"},"modified":"2023-05-20T21:26:43","modified_gmt":"2023-05-20T19:26:43","slug":"market-capitalization","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/market-capitalization","title":{"rendered":"Market Capitalization"},"content":{"rendered":"\n<p>Market capitalization (also referred to as market cap) is a term used to describe the total value of a company’s publicly traded shares. It is calculated by multiplying the total number of outstanding shares of a company by its current share price. For example, a company with 1 million shares at a price of $20 per share would have a market cap of $20 million.<\/p>\n\n\n\n<p>Market capitalization serves as an indicator of a company’s size and is often used to compare companies in the same industry. Companies with higher market caps are considered to be “blue-chip” or established companies, while companies with lower market caps are often referred to as “micro-caps” or start-up companies.<\/p>\n\n\n\n<p>Market capitalization can also offer insight into a company’s level of liquidity as larger companies with higher market caps tend to have more trading volume, which can lead to greater liquidity for investors. Additionally, investors can use market capitalization as a measure of stock volatility; stocks with lower market caps tend to experience larger fluctuations in price than stocks with higher market caps, making them riskier investments.<\/p>\n\n\n\n<p>As market capitalization is based on current ownership, share prices, and the number of outstanding shares it is an important concept investors should understand. By evaluating the market capitalization of companies before making an investment, investors can more accurately identify those that are well-established and those that may be more prone to risks.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[38],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/967"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=967"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=967"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=967"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}