{"id":968,"date":"2023-05-18T21:34:17","date_gmt":"2023-05-18T19:34:17","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=968"},"modified":"2023-05-20T21:28:50","modified_gmt":"2023-05-20T19:28:50","slug":"mempool","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/mempool","title":{"rendered":"Mempool"},"content":{"rendered":"\n<p>A mempool is a data structure which stores unconfirmed transactions sent by users to the Bitcoin network. It acts as a temporary, unsorted holding area before transactions are added to the blockchain. The mempool contains all the transactions that have been broadcast but for some reason, haven’t been picked up by miners yet.<\/p>\n\n\n\n<p>Each node of the Bitcoin network will maintain their own version of the mempool, with all the transactions that that node is aware of. The name ‘mempool’ is derived from ‘memory pool’, since this is an area of memory dedicated to storing unconfirmed transactions.<\/p>\n\n\n\n<p>When a user sends a transaction and broadcasts it throughout the network, it first enters the mempool and waits until it is included in a new block by a miner. After entering the mempool, it is then up to miners to decide which transactions they want to include in their blocks- this process is known as transaction selection.<\/p>\n\n\n\n<p>Miners usually prioritize transactions by their fee rate, meaning they tend to select those with higher fees first. The mempool is an important part of the Bitcoin network, as it allows transactions to remain valid until they are included in a block. Without it, users would have to constantly resend transactions which could lead to more network traffic and higher fees.<\/p>\n\n\n\n<p>In order to ensure transactions remain valid and avoid double-spending, nodes in the network have to keep track of all the unconfirmed transactions in the mempool.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[38],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/968"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=968"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=968"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=968"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=968"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}