{"id":989,"date":"2023-05-18T21:39:49","date_gmt":"2023-05-18T19:39:49","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=989"},"modified":"2023-05-20T21:32:13","modified_gmt":"2023-05-20T19:32:13","slug":"ordinals","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/ordinals","title":{"rendered":"Ordinals"},"content":{"rendered":"\n<p>Ordinals provide a way to uniquely identify and track individual satoshis within the Bitcoin blockchain. This can be useful for a variety of applications, such as tracking the ownership and transfer of specific coins, attaching metadata or digital artifacts to coins, and creating new types of financial instruments or tokens.<\/p>\n\n\n\n<p>One key feature of the ordinal numbering scheme is that it is based on the order in which satoshis are mined, rather than their value or other attributes. This means that each satoshi has a unique and stable identifier that is independent of its market value, which can fluctuate over time.<\/p>\n\n\n\n<p>There are several different ways to represent ordinal numbers, including integer, decimal, degree, and percentile notations. Each of these representations provides different information about the ordinal number, such as the block height and offset of the corresponding satoshi, its position in the Bitcoin supply, and its rarity level based on various periodic events in the Bitcoin network.<\/p>\n\n\n\n<p>The rarity levels for satoshis are based on four different types of periodic events in the Bitcoin network: blocks, difficulty adjustments, halvings, and cycles. Each of these events has a different frequency and impact on the Bitcoin ecosystem, and can be used to create a hierarchy of rarity levels for satoshis.<\/p>\n\n\n\n<p>The most rare and valuable satoshis are those that are associated with the earliest and most significant events in Bitcoin&#8217;s history, such as the first block and the first halving epoch. As more developers and users become aware of the potential of ordinal numbers, we may see new and innovative applications emerge that take advantage of their unique properties and capabilities.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[40],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/989"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=989"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=989"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=989"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=989"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}