{"id":994,"date":"2023-05-18T21:41:57","date_gmt":"2023-05-18T19:41:57","guid":{"rendered":"https:\/\/securenest.org\/?post_type=glossary&#038;p=994"},"modified":"2023-05-20T21:38:19","modified_gmt":"2023-05-20T19:38:19","slug":"p2sh-pay-to-script-hash","status":"publish","type":"glossary","link":"https:\/\/securenest.org\/glossary\/p2sh-pay-to-script-hash","title":{"rendered":"P2SH (Pay-to-Script-Hash)"},"content":{"rendered":"\n<p>Pay-to-Script-Hash (P2SH) is a protocol which enables the sender to submit a cryptographic hash of a script, instead of the script itself, to the recipient. In other words, P2SH allows users to send Bitcoins to a so-called address prefix, instead of to a complete Bitcoin address.<\/p>\n\n\n\n<p>The prefix constitutes a partial script which can only be redeemed with a full script matching the supplied hash. This feature makes it easier for users to send and receive complex multi-signature transactions without needing to manually share or distribute information about the transaction&#8217;s script prior to sending it.<\/p>\n\n\n\n<p>P2SH enables users to securely execute scripts without having to directly communicate their script sequences. It also enables users to create an alias for their P2SH address and share it easily with the recipient. The use of hash values in the P2SH protocol serves as both a validation check and a security measure.<\/p>\n\n\n\n<p>It ensures that only the intended recipient can redeem the payment as it requires knowledge of the full script – as well as its corresponding hash – which is only held by the sender and receiver. Hashing also improves scalability, since the full script doesn&#8217;t need to be included in every transaction.<\/p>\n\n\n\n<p>P2SH is one of several methods available on the Bitcoin platform for automating multi-signature transactions without having to expose what&#8217;s contained in the transaction. Its security features provide a high degree of confidence when sending Bitcoin payments.<\/p>\n","protected":false},"featured_media":0,"template":"","categories":[24],"tags":[],"letters":[41],"acf":[],"_links":{"self":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary\/994"}],"collection":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/glossary"}],"about":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/types\/glossary"}],"wp:attachment":[{"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/media?parent=994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/categories?post=994"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/tags?post=994"},{"taxonomy":"letters","embeddable":true,"href":"https:\/\/securenest.org\/wp-json\/wp\/v2\/letters?post=994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}